/* automatically generated by rust-bindgen 0.64.0 */

pub const LZ4_HEAPMODE: u32 = 0;
pub const LZ4_ACCELERATION_DEFAULT: u32 = 1;
pub const LZ4_ACCELERATION_MAX: u32 = 65537;
pub const LZ4_SRC_INCLUDED: u32 = 1;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;

pub const LZ4HC_CLEVEL_MAX: u32 = 12;
pub const LZ4HC_DICTIONARY_LOGSIZE: u32 = 16;
pub const LZ4HC_MAXD: u32 = 65536;
pub const LZ4HC_MAXD_MASK: u32 = 65535;
pub const LZ4HC_HASH_LOG: u32 = 15;
pub const LZ4HC_HASHTABLESIZE: u32 = 32768;
pub const LZ4HC_HASH_MASK: u32 = 32767;
pub const LZ4_STREAMHC_MINSIZE: u32 = 262200;
pub const LZ4_OPT_NUM: u32 = 4096;
pub const TRAILING_LITERALS: u32 = 3;
pub const LZ4F_HEAPMODE: u32 = 0;
pub const LZ4F_VERSION: u32 = 100;
pub const LZ4F_HEADER_SIZE_MIN: u32 = 7;
pub const LZ4F_HEADER_SIZE_MAX: u32 = 19;
pub const LZ4F_BLOCK_HEADER_SIZE: u32 = 4;
pub const LZ4F_BLOCK_CHECKSUM_SIZE: u32 = 4;
pub const LZ4F_CONTENT_CHECKSUM_SIZE: u32 = 4;
pub const LZ4F_MAGICNUMBER: u32 = 407708164;
pub const LZ4F_MAGIC_SKIPPABLE_START: u32 = 407710288;
pub const LZ4F_MIN_SIZE_TO_KNOW_HEADER_LENGTH: u32 = 5;
pub const XXHASH_H_5627135585666179: u32 = 1;
pub const XXH_VERSION_MAJOR: u32 = 0;
pub const XXH_VERSION_MINOR: u32 = 6;
pub const XXH_VERSION_RELEASE: u32 = 5;
pub const XXH_VERSION_NUMBER: u32 = 605;
pub const _1BIT: u32 = 1;
pub const _2BITS: u32 = 3;
pub const _3BITS: u32 = 7;
pub const _4BITS: u32 = 15;
pub const _8BITS: u32 = 255;
pub const LZ4F_BLOCKUNCOMPRESSED_FLAG: u32 = 2147483648;
pub const XXH_ACCEPT_NULL_INPUT_POINTER: u32 = 0;
pub const XXH_FORCE_NATIVE_FORMAT: u32 = 0;
pub const XXH_FORCE_ALIGN_CHECK: u32 = 0;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_data_public> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_lc_codepage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_pointers> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(mbcinfo)
        )
    );
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    const UNINIT: ::std::mem::MaybeUninit<_Mbstatet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn __threadid() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __threadhandle() -> usize;
}
extern "C" {
    pub fn LZ4_versionNumber() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_versionString() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " LZ4_compress_default() :\n  Compresses 'srcSize' bytes from buffer 'src'\n  into already allocated 'dst' buffer of size 'dstCapacity'.\n  Compression is guaranteed to succeed if 'dstCapacity' >= LZ4_compressBound(srcSize).\n  It also runs faster, so it's a recommended setting.\n  If the function cannot compress 'src' into a more limited 'dst' budget,\n  compression stops *immediately*, and the function result is zero.\n  In which case, 'dst' content is undefined (invalid).\n      srcSize : max supported value is LZ4_MAX_INPUT_SIZE.\n      dstCapacity : size of buffer 'dst' (which must be already allocated)\n     @return  : the number of bytes written into buffer 'dst' (necessarily <= dstCapacity)\n                or 0 if compression fails\n Note : This function is protected against buffer overflow scenarios (never writes outside 'dst' buffer, nor read outside 'source' buffer)."]
    pub fn LZ4_compress_default(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        srcSize: ::std::os::raw::c_int,
        dstCapacity: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_decompress_safe() :\n  compressedSize : is the exact complete size of the compressed block.\n  dstCapacity : is the size of destination buffer (which must be already allocated), presumed an upper bound of decompressed size.\n @return : the number of bytes decompressed into destination buffer (necessarily <= dstCapacity)\n           If destination buffer is not large enough, decoding will stop and output an error code (negative value).\n           If the source stream is detected malformed, the function will stop decoding and return a negative result.\n Note 1 : This function is protected against malicious data packets :\n          it will never writes outside 'dst' buffer, nor read outside 'source' buffer,\n          even if the compressed block is maliciously modified to order the decoder to do these actions.\n          In such case, the decoder stops immediately, and considers the compressed block malformed.\n Note 2 : compressedSize and dstCapacity must be provided to the function, the compressed block does not contain them.\n          The implementation is free to send / store / derive this information in whichever way is most beneficial.\n          If there is a need for a different format which bundles together both compressed data and its metadata, consider looking at lz4frame.h instead."]
    pub fn LZ4_decompress_safe(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        compressedSize: ::std::os::raw::c_int,
        dstCapacity: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_compressBound() :\nProvides the maximum size that LZ4 compression may output in a \"worst case\" scenario (input data not compressible)\nThis function is primarily useful for memory allocation purposes (destination buffer size).\nMacro LZ4_COMPRESSBOUND() is also provided for compilation-time evaluation (stack memory allocation for example).\nNote that LZ4_compress_default() compresses faster when dstCapacity is >= LZ4_compressBound(srcSize)\ninputSize  : max supported value is LZ4_MAX_INPUT_SIZE\nreturn : maximum output size in a \"worst case\" scenario\nor 0, if input size is incorrect (too large or negative)"]
    pub fn LZ4_compressBound(inputSize: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_compress_fast() :\nSame as LZ4_compress_default(), but allows selection of \"acceleration\" factor.\nThe larger the acceleration value, the faster the algorithm, but also the lesser the compression.\nIt's a trade-off. It can be fine tuned, with each successive value providing roughly +~3% to speed.\nAn acceleration value of \"1\" is the same as regular LZ4_compress_default()\nValues <= 0 will be replaced by LZ4_ACCELERATION_DEFAULT (currently == 1, see lz4.c).\nValues > LZ4_ACCELERATION_MAX will be replaced by LZ4_ACCELERATION_MAX (currently == 65537, see lz4.c)."]
    pub fn LZ4_compress_fast(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        srcSize: ::std::os::raw::c_int,
        dstCapacity: ::std::os::raw::c_int,
        acceleration: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_compress_fast_extState() :\n  Same as LZ4_compress_fast(), using an externally allocated memory space for its state.\n  Use LZ4_sizeofState() to know how much memory must be allocated,\n  and allocate it on 8-bytes boundaries (using `malloc()` typically).\n  Then, provide this buffer as `void* state` to compression function."]
    pub fn LZ4_sizeofState() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_compress_fast_extState(
        state: *mut ::std::os::raw::c_void,
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        srcSize: ::std::os::raw::c_int,
        dstCapacity: ::std::os::raw::c_int,
        acceleration: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_compress_destSize() :\n  Reverse the logic : compresses as much data as possible from 'src' buffer\n  into already allocated buffer 'dst', of size >= 'targetDestSize'.\n  This function either compresses the entire 'src' content into 'dst' if it's large enough,\n  or fill 'dst' buffer completely with as much data as possible from 'src'.\n  note: acceleration parameter is fixed to \"default\".\n\n *srcSizePtr : will be modified to indicate how many bytes where read from 'src' to fill 'dst'.\n               New value is necessarily <= input value.\n @return : Nb bytes written into 'dst' (necessarily <= targetDestSize)\n           or 0 if compression fails.\n\n Note : from v1.8.2 to v1.9.1, this function had a bug (fixed un v1.9.2+):\n        the produced compressed content could, in specific circumstances,\n        require to be decompressed into a destination buffer larger\n        by at least 1 byte than the content to decompress.\n        If an application uses `LZ4_compress_destSize()`,\n        it's highly recommended to update liblz4 to v1.9.2 or better.\n        If this can't be done or ensured,\n        the receiving decompression function should provide\n        a dstCapacity which is > decompressedSize, by at least 1 byte.\n        See https://github.com/lz4/lz4/issues/859 for details"]
    pub fn LZ4_compress_destSize(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        srcSizePtr: *mut ::std::os::raw::c_int,
        targetDstSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_decompress_safe_partial() :\n  Decompress an LZ4 compressed block, of size 'srcSize' at position 'src',\n  into destination buffer 'dst' of size 'dstCapacity'.\n  Up to 'targetOutputSize' bytes will be decoded.\n  The function stops decoding on reaching this objective.\n  This can be useful to boost performance\n  whenever only the beginning of a block is required.\n\n @return : the number of bytes decoded in `dst` (necessarily <= targetOutputSize)\n           If source stream is detected malformed, function returns a negative result.\n\n  Note 1 : @return can be < targetOutputSize, if compressed block contains less data.\n\n  Note 2 : targetOutputSize must be <= dstCapacity\n\n  Note 3 : this function effectively stops decoding on reaching targetOutputSize,\n           so dstCapacity is kind of redundant.\n           This is because in older versions of this function,\n           decoding operation would still write complete sequences.\n           Therefore, there was no guarantee that it would stop writing at exactly targetOutputSize,\n           it could write more bytes, though only up to dstCapacity.\n           Some \"margin\" used to be required for this operation to work properly.\n           Thankfully, this is no longer necessary.\n           The function nonetheless keeps the same signature, in an effort to preserve API compatibility.\n\n  Note 4 : If srcSize is the exact size of the block,\n           then targetOutputSize can be any value,\n           including larger than the block's decompressed size.\n           The function will, at most, generate block's decompressed size.\n\n  Note 5 : If srcSize is _larger_ than block's compressed size,\n           then targetOutputSize **MUST** be <= block's decompressed size.\n           Otherwise, *silent corruption will occur*."]
    pub fn LZ4_decompress_safe_partial(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        srcSize: ::std::os::raw::c_int,
        targetOutputSize: ::std::os::raw::c_int,
        dstCapacity: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type LZ4_stream_t = LZ4_stream_u;
extern "C" {
    pub fn LZ4_createStream() -> *mut LZ4_stream_t;
}
extern "C" {
    pub fn LZ4_freeStream(streamPtr: *mut LZ4_stream_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_resetStream_fast() : v1.9.0+\n  Use this to prepare an LZ4_stream_t for a new chain of dependent blocks\n  (e.g., LZ4_compress_fast_continue()).\n\n  An LZ4_stream_t must be initialized once before usage.\n  This is automatically done when created by LZ4_createStream().\n  However, should the LZ4_stream_t be simply declared on stack (for example),\n  it's necessary to initialize it first, using LZ4_initStream().\n\n  After init, start any new stream with LZ4_resetStream_fast().\n  A same LZ4_stream_t can be re-used multiple times consecutively\n  and compress multiple streams,\n  provided that it starts each new stream with LZ4_resetStream_fast().\n\n  LZ4_resetStream_fast() is much faster than LZ4_initStream(),\n  but is not compatible with memory regions containing garbage data.\n\n  Note: it's only useful to call LZ4_resetStream_fast()\n        in the context of streaming compression.\n        The *extState* functions perform their own resets.\n        Invoking LZ4_resetStream_fast() before is redundant, and even counterproductive."]
    pub fn LZ4_resetStream_fast(streamPtr: *mut LZ4_stream_t);
}
extern "C" {
    #[doc = " LZ4_loadDict() :\n  Use this function to reference a static dictionary into LZ4_stream_t.\n  The dictionary must remain available during compression.\n  LZ4_loadDict() triggers a reset, so any previous data will be forgotten.\n  The same dictionary will have to be loaded on decompression side for successful decoding.\n  Dictionary are useful for better compression of small data (KB range).\n  While LZ4 accept any input as dictionary,\n  results are generally better when using Zstandard's Dictionary Builder.\n  Loading a size of 0 is allowed, and is the same as reset.\n @return : loaded dictionary size, in bytes (necessarily <= 64 KB)"]
    pub fn LZ4_loadDict(
        streamPtr: *mut LZ4_stream_t,
        dictionary: *const ::std::os::raw::c_char,
        dictSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_compress_fast_continue() :\n  Compress 'src' content using data from previously compressed blocks, for better compression ratio.\n 'dst' buffer must be already allocated.\n  If dstCapacity >= LZ4_compressBound(srcSize), compression is guaranteed to succeed, and runs faster.\n\n @return : size of compressed block\n           or 0 if there is an error (typically, cannot fit into 'dst').\n\n  Note 1 : Each invocation to LZ4_compress_fast_continue() generates a new block.\n           Each block has precise boundaries.\n           Each block must be decompressed separately, calling LZ4_decompress_*() with relevant metadata.\n           It's not possible to append blocks together and expect a single invocation of LZ4_decompress_*() to decompress them together.\n\n  Note 2 : The previous 64KB of source data is __assumed__ to remain present, unmodified, at same address in memory !\n\n  Note 3 : When input is structured as a double-buffer, each buffer can have any size, including < 64 KB.\n           Make sure that buffers are separated, by at least one byte.\n           This construction ensures that each block only depends on previous block.\n\n  Note 4 : If input buffer is a ring-buffer, it can have any size, including < 64 KB.\n\n  Note 5 : After an error, the stream status is undefined (invalid), it can only be reset or freed."]
    pub fn LZ4_compress_fast_continue(
        streamPtr: *mut LZ4_stream_t,
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        srcSize: ::std::os::raw::c_int,
        dstCapacity: ::std::os::raw::c_int,
        acceleration: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_saveDict() :\n  If last 64KB data cannot be guaranteed to remain available at its current memory location,\n  save it into a safer place (char* safeBuffer).\n  This is schematically equivalent to a memcpy() followed by LZ4_loadDict(),\n  but is much faster, because LZ4_saveDict() doesn't need to rebuild tables.\n @return : saved dictionary size in bytes (necessarily <= maxDictSize), or 0 if error."]
    pub fn LZ4_saveDict(
        streamPtr: *mut LZ4_stream_t,
        safeBuffer: *mut ::std::os::raw::c_char,
        maxDictSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type LZ4_streamDecode_t = LZ4_streamDecode_u;
extern "C" {
    pub fn LZ4_createStreamDecode() -> *mut LZ4_streamDecode_t;
}
extern "C" {
    pub fn LZ4_freeStreamDecode(LZ4_stream: *mut LZ4_streamDecode_t) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_setStreamDecode() :\n  An LZ4_streamDecode_t context can be allocated once and re-used multiple times.\n  Use this function to start decompression of a new stream of blocks.\n  A dictionary can optionally be set. Use NULL or size 0 for a reset order.\n  Dictionary is presumed stable : it must remain accessible and unmodified during next decompression.\n @return : 1 if OK, 0 if error"]
    pub fn LZ4_setStreamDecode(
        LZ4_streamDecode: *mut LZ4_streamDecode_t,
        dictionary: *const ::std::os::raw::c_char,
        dictSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_decoderRingBufferSize() : v1.8.2+\n  Note : in a ring buffer scenario (optional),\n  blocks are presumed decompressed next to each other\n  up to the moment there is not enough remaining space for next block (remainingSize < maxBlockSize),\n  at which stage it resumes from beginning of ring buffer.\n  When setting such a ring buffer for streaming decompression,\n  provides the minimum size of this ring buffer\n  to be compatible with any source respecting maxBlockSize condition.\n @return : minimum ring buffer size,\n           or 0 if there is an error (invalid maxBlockSize)."]
    pub fn LZ4_decoderRingBufferSize(maxBlockSize: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_decompress_*_continue() :\n  These decoding functions allow decompression of consecutive blocks in \"streaming\" mode.\n  A block is an unsplittable entity, it must be presented entirely to a decompression function.\n  Decompression functions only accepts one block at a time.\n  The last 64KB of previously decoded data *must* remain available and unmodified at the memory position where they were decoded.\n  If less than 64KB of data has been decoded, all the data must be present.\n\n  Special : if decompression side sets a ring buffer, it must respect one of the following conditions :\n  - Decompression buffer size is _at least_ LZ4_decoderRingBufferSize(maxBlockSize).\n    maxBlockSize is the maximum size of any single block. It can have any value > 16 bytes.\n    In which case, encoding and decoding buffers do not need to be synchronized.\n    Actually, data can be produced by any source compliant with LZ4 format specification, and respecting maxBlockSize.\n  - Synchronized mode :\n    Decompression buffer size is _exactly_ the same as compression buffer size,\n    and follows exactly same update rule (block boundaries at same positions),\n    and decoding function is provided with exact decompressed size of each block (exception for last block of the stream),\n    _then_ decoding & encoding ring buffer can have any size, including small ones ( < 64 KB).\n  - Decompression buffer is larger than encoding buffer, by a minimum of maxBlockSize more bytes.\n    In which case, encoding and decoding buffers do not need to be synchronized,\n    and encoding ring buffer can have any size, including small ones ( < 64 KB).\n\n  Whenever these conditions are not possible,\n  save the last 64KB of decoded data into a safe buffer where it can't be modified during decompression,\n  then indicate where this data is saved using LZ4_setStreamDecode(), before decompressing next block."]
    pub fn LZ4_decompress_safe_continue(
        LZ4_streamDecode: *mut LZ4_streamDecode_t,
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        srcSize: ::std::os::raw::c_int,
        dstCapacity: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_decompress_*_usingDict() :\n  These decoding functions work the same as\n  a combination of LZ4_setStreamDecode() followed by LZ4_decompress_*_continue()\n  They are stand-alone, and don't need an LZ4_streamDecode_t structure.\n  Dictionary is presumed stable : it must remain accessible and unmodified during decompression.\n  Performance tip : Decompression speed can be substantially increased\n                    when dst == dictStart + dictSize."]
    pub fn LZ4_decompress_safe_usingDict(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        srcSize: ::std::os::raw::c_int,
        dstCapacity: ::std::os::raw::c_int,
        dictStart: *const ::std::os::raw::c_char,
        dictSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_decompress_safe_partial_usingDict(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        compressedSize: ::std::os::raw::c_int,
        targetOutputSize: ::std::os::raw::c_int,
        maxOutputSize: ::std::os::raw::c_int,
        dictStart: *const ::std::os::raw::c_char,
        dictSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_compress_fast_extState_fastReset() :\n  A variant of LZ4_compress_fast_extState().\n\n  Using this variant avoids an expensive initialization step.\n  It is only safe to call if the state buffer is known to be correctly initialized already\n  (see above comment on LZ4_resetStream_fast() for a definition of \"correctly initialized\").\n  From a high level, the difference is that\n  this function initializes the provided state with a call to something like LZ4_resetStream_fast()\n  while LZ4_compress_fast_extState() starts with a call to LZ4_resetStream()."]
    pub fn LZ4_compress_fast_extState_fastReset(
        state: *mut ::std::os::raw::c_void,
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        srcSize: ::std::os::raw::c_int,
        dstCapacity: ::std::os::raw::c_int,
        acceleration: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_attach_dictionary() :\n  This is an experimental API that allows\n  efficient use of a static dictionary many times.\n\n  Rather than re-loading the dictionary buffer into a working context before\n  each compression, or copying a pre-loaded dictionary's LZ4_stream_t into a\n  working LZ4_stream_t, this function introduces a no-copy setup mechanism,\n  in which the working stream references the dictionary stream in-place.\n\n  Several assumptions are made about the state of the dictionary stream.\n  Currently, only streams which have been prepared by LZ4_loadDict() should\n  be expected to work.\n\n  Alternatively, the provided dictionaryStream may be NULL,\n  in which case any existing dictionary stream is unset.\n\n  If a dictionary is provided, it replaces any pre-existing stream history.\n  The dictionary contents are the only history that can be referenced and\n  logically immediately precede the data compressed in the first subsequent\n  compression call.\n\n  The dictionary will only remain attached to the working stream through the\n  first compression call, at the end of which it is cleared. The dictionary\n  stream (and source buffer) must remain in-place / accessible / unchanged\n  through the completion of the first compression call on the stream."]
    pub fn LZ4_attach_dictionary(
        workingStream: *mut LZ4_stream_t,
        dictionaryStream: *const LZ4_stream_t,
    );
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type LZ4_i8 = i8;
pub type LZ4_byte = u8;
pub type LZ4_u16 = u16;
pub type LZ4_u32 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LZ4_stream_t_internal {
    pub hashTable: [LZ4_u32; 4096usize],
    pub dictionary: *const LZ4_byte,
    pub dictCtx: *const LZ4_stream_t_internal,
    pub currentOffset: LZ4_u32,
    pub tableType: LZ4_u32,
    pub dictSize: LZ4_u32,
}
#[test]
fn bindgen_test_layout_LZ4_stream_t_internal() {
    const UNINIT: ::std::mem::MaybeUninit<LZ4_stream_t_internal> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LZ4_stream_t_internal>(),
        16416usize,
        concat!("Size of: ", stringify!(LZ4_stream_t_internal))
    );
    assert_eq!(
        ::std::mem::align_of::<LZ4_stream_t_internal>(),
        8usize,
        concat!("Alignment of ", stringify!(LZ4_stream_t_internal))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hashTable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_stream_t_internal),
            "::",
            stringify!(hashTable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dictionary) as usize - ptr as usize },
        16384usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_stream_t_internal),
            "::",
            stringify!(dictionary)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dictCtx) as usize - ptr as usize },
        16392usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_stream_t_internal),
            "::",
            stringify!(dictCtx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).currentOffset) as usize - ptr as usize },
        16400usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_stream_t_internal),
            "::",
            stringify!(currentOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tableType) as usize - ptr as usize },
        16404usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_stream_t_internal),
            "::",
            stringify!(tableType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dictSize) as usize - ptr as usize },
        16408usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_stream_t_internal),
            "::",
            stringify!(dictSize)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union LZ4_stream_u {
    pub minStateSize: [::std::os::raw::c_char; 16416usize],
    pub internal_donotuse: LZ4_stream_t_internal,
}
#[test]
fn bindgen_test_layout_LZ4_stream_u() {
    const UNINIT: ::std::mem::MaybeUninit<LZ4_stream_u> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LZ4_stream_u>(),
        16416usize,
        concat!("Size of: ", stringify!(LZ4_stream_u))
    );
    assert_eq!(
        ::std::mem::align_of::<LZ4_stream_u>(),
        8usize,
        concat!("Alignment of ", stringify!(LZ4_stream_u))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minStateSize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_stream_u),
            "::",
            stringify!(minStateSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).internal_donotuse) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_stream_u),
            "::",
            stringify!(internal_donotuse)
        )
    );
}
extern "C" {
    #[doc = " LZ4_initStream() : v1.9.0+\n  An LZ4_stream_t structure must be initialized at least once.\n  This is automatically done when invoking LZ4_createStream(),\n  but it's not when the structure is simply declared on stack (for example).\n\n  Use LZ4_initStream() to properly initialize a newly declared LZ4_stream_t.\n  It can also initialize any arbitrary buffer of sufficient size,\n  and will @return a pointer of proper type upon initialization.\n\n  Note : initialization fails if size and alignment conditions are not respected.\n         In which case, the function will @return NULL.\n  Note2: An LZ4_stream_t structure guarantees correct alignment and size.\n  Note3: Before v1.9.0, use LZ4_resetStream() instead"]
    pub fn LZ4_initStream(buffer: *mut ::std::os::raw::c_void, size: usize) -> *mut LZ4_stream_t;
}
#[doc = " LZ4_streamDecode_t :\n  Never ever use below internal definitions directly !\n  These definitions are not API/ABI safe, and may change in future versions.\n  If you need static allocation, declare or allocate an LZ4_streamDecode_t object."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LZ4_streamDecode_t_internal {
    pub externalDict: *const LZ4_byte,
    pub prefixEnd: *const LZ4_byte,
    pub extDictSize: usize,
    pub prefixSize: usize,
}
#[test]
fn bindgen_test_layout_LZ4_streamDecode_t_internal() {
    const UNINIT: ::std::mem::MaybeUninit<LZ4_streamDecode_t_internal> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LZ4_streamDecode_t_internal>(),
        32usize,
        concat!("Size of: ", stringify!(LZ4_streamDecode_t_internal))
    );
    assert_eq!(
        ::std::mem::align_of::<LZ4_streamDecode_t_internal>(),
        8usize,
        concat!("Alignment of ", stringify!(LZ4_streamDecode_t_internal))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).externalDict) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_streamDecode_t_internal),
            "::",
            stringify!(externalDict)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prefixEnd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_streamDecode_t_internal),
            "::",
            stringify!(prefixEnd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extDictSize) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_streamDecode_t_internal),
            "::",
            stringify!(extDictSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prefixSize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_streamDecode_t_internal),
            "::",
            stringify!(prefixSize)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union LZ4_streamDecode_u {
    pub minStateSize: [::std::os::raw::c_char; 32usize],
    pub internal_donotuse: LZ4_streamDecode_t_internal,
}
#[test]
fn bindgen_test_layout_LZ4_streamDecode_u() {
    const UNINIT: ::std::mem::MaybeUninit<LZ4_streamDecode_u> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<LZ4_streamDecode_u>(),
        32usize,
        concat!("Size of: ", stringify!(LZ4_streamDecode_u))
    );
    assert_eq!(
        ::std::mem::align_of::<LZ4_streamDecode_u>(),
        8usize,
        concat!("Alignment of ", stringify!(LZ4_streamDecode_u))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minStateSize) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_streamDecode_u),
            "::",
            stringify!(minStateSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).internal_donotuse) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LZ4_streamDecode_u),
            "::",
            stringify!(internal_donotuse)
        )
    );
}
extern "C" {
    #[doc = " Obsolete compression functions (since v1.7.3)"]
    pub fn LZ4_compress(
        src: *const ::std::os::raw::c_char,
        dest: *mut ::std::os::raw::c_char,
        srcSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_compress_limitedOutput(
        src: *const ::std::os::raw::c_char,
        dest: *mut ::std::os::raw::c_char,
        srcSize: ::std::os::raw::c_int,
        maxOutputSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_compress_withState(
        state: *mut ::std::os::raw::c_void,
        source: *const ::std::os::raw::c_char,
        dest: *mut ::std::os::raw::c_char,
        inputSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_compress_limitedOutput_withState(
        state: *mut ::std::os::raw::c_void,
        source: *const ::std::os::raw::c_char,
        dest: *mut ::std::os::raw::c_char,
        inputSize: ::std::os::raw::c_int,
        maxOutputSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_compress_continue(
        LZ4_streamPtr: *mut LZ4_stream_t,
        source: *const ::std::os::raw::c_char,
        dest: *mut ::std::os::raw::c_char,
        inputSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_compress_limitedOutput_continue(
        LZ4_streamPtr: *mut LZ4_stream_t,
        source: *const ::std::os::raw::c_char,
        dest: *mut ::std::os::raw::c_char,
        inputSize: ::std::os::raw::c_int,
        maxOutputSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Obsolete decompression functions (since v1.8.0)"]
    pub fn LZ4_uncompress(
        source: *const ::std::os::raw::c_char,
        dest: *mut ::std::os::raw::c_char,
        outputSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_uncompress_unknownOutputSize(
        source: *const ::std::os::raw::c_char,
        dest: *mut ::std::os::raw::c_char,
        isize_: ::std::os::raw::c_int,
        maxOutputSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_create(inputBuffer: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn LZ4_sizeofStreamState() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_resetStreamState(
        state: *mut ::std::os::raw::c_void,
        inputBuffer: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_slideInputBuffer(state: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " Obsolete streaming decoding functions (since v1.7.0)"]
    pub fn LZ4_decompress_safe_withPrefix64k(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        compressedSize: ::std::os::raw::c_int,
        maxDstSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_decompress_fast_withPrefix64k(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        originalSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " Obsolete LZ4_decompress_fast variants (since v1.9.0) :\n  These functions used to be faster than LZ4_decompress_safe(),\n  but this is no longer the case. They are now slower.\n  This is because LZ4_decompress_fast() doesn't know the input size,\n  and therefore must progress more cautiously into the input buffer to not read beyond the end of block.\n  On top of that `LZ4_decompress_fast()` is not protected vs malformed or malicious inputs, making it a security liability.\n  As a consequence, LZ4_decompress_fast() is strongly discouraged, and deprecated.\n\n  The last remaining LZ4_decompress_fast() specificity is that\n  it can decompress a block without knowing its compressed size.\n  Such functionality can be achieved in a more secure manner\n  by employing LZ4_decompress_safe_partial().\n\n  Parameters:\n  originalSize : is the uncompressed size to regenerate.\n                 `dst` must be already allocated, its size must be >= 'originalSize' bytes.\n @return : number of bytes read from source buffer (== compressed size).\n           The function expects to finish at block's end exactly.\n           If the source stream is detected malformed, the function stops decoding and returns a negative result.\n  note : LZ4_decompress_fast*() requires originalSize. Thanks to this information, it never writes past the output buffer.\n         However, since it doesn't know its 'src' size, it may read an unknown amount of input, past input buffer bounds.\n         Also, since match offsets are not validated, match reads from 'src' may underflow too.\n         These issues never happen if input (compressed) data is correct.\n         But they may happen if input data is invalid (error or intentional tampering).\n         As a consequence, use these functions in trusted environments with trusted data **only**."]
    pub fn LZ4_decompress_fast(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        originalSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_decompress_fast_continue(
        LZ4_streamDecode: *mut LZ4_streamDecode_t,
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        originalSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn LZ4_decompress_fast_usingDict(
        src: *const ::std::os::raw::c_char,
        dst: *mut ::std::os::raw::c_char,
        originalSize: ::std::os::raw::c_int,
        dictStart: *const ::std::os::raw::c_char,
        dictSize: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " LZ4_resetStream() :\n  An LZ4_stream_t structure must be initialized at least once.\n  This is done with LZ4_initStream(), or LZ4_resetStream().\n  Consider switching to LZ4_initStream(),\n  invoking LZ4_resetStream() will trigger deprecation warnings in the future."]
    pub fn LZ4_resetStream(streamPtr: *mut LZ4_stream_t);
}
extern "C" {
    pub fn _BitScanForward(
        _Index: *mut ::std::os::raw::c_ulong,
        _Mask: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _BitScanForward64(
        _Index: *mut ::std::os::raw::c_ulong,
        _Mask: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _BitScanReverse(
        _Index: *mut ::std::os::raw::c_ulong,
        _Mask: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _BitScanReverse64(
        _Index: *mut ::std::os::raw::c_ulong,
        _Mask: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _bittest(
        arg1: *const ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _InterlockedAnd(
        _Value: *mut ::std::os::raw::c_long,
        _Mask: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedAnd16(
        _Value: *mut ::std::os::raw::c_short,
        _Mask: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedAnd64(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _interlockedand64(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedAnd8(
        _Value: *mut ::std::os::raw::c_char,
        _Mask: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn _InterlockedCompareExchange(
        _Destination: *mut ::std::os::raw::c_long,
        _Exchange: ::std::os::raw::c_long,
        _Comparand: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedCompareExchange16(
        _Destination: *mut ::std::os::raw::c_short,
        _Exchange: ::std::os::raw::c_short,
        _Comparand: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedCompareExchange64(
        _Destination: *mut ::std::os::raw::c_longlong,
        _Exchange: ::std::os::raw::c_longlong,
        _Comparand: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedCompareExchange8(
        _Destination: *mut ::std::os::raw::c_char,
        _Exchange: ::std::os::raw::c_char,
        _Comparand: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn _InterlockedCompareExchange128(
        _Destination: *mut ::std::os::raw::c_longlong,
        _ExchangeHigh: ::std::os::raw::c_longlong,
        _ExchangeLow: ::std::os::raw::c_longlong,
        _ComparandResult: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _InterlockedDecrement(_Addend: *mut ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedDecrement16(
        _Addend: *mut ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedDecrement64(
        _Addend: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _interlockeddecrement64(
        _Addend: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedExchange(
        _Target: *mut ::std::os::raw::c_long,
        _Value: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedExchange16(
        _Target: *mut ::std::os::raw::c_short,
        _Value: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedExchange64(
        _Target: *mut ::std::os::raw::c_longlong,
        _Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _interlockedexchange64(
        _Target: *mut ::std::os::raw::c_longlong,
        _Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedExchange8(
        _Target: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn _InterlockedExchangeAdd(
        _Addend: *mut ::std::os::raw::c_long,
        _Value: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedExchangeAdd16(
        _Addend: *mut ::std::os::raw::c_short,
        _Value: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedExchangeAdd64(
        _Addend: *mut ::std::os::raw::c_longlong,
        _Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _interlockedexchangeadd64(
        _Addend: *mut ::std::os::raw::c_longlong,
        _Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedExchangeAdd8(
        _Addend: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn _InterlockedIncrement(_Addend: *mut ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedIncrement16(
        _Addend: *mut ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedIncrement64(
        _Addend: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _interlockedincrement64(
        _Addend: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedOr(
        _Value: *mut ::std::os::raw::c_long,
        _Mask: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedOr16(
        _Value: *mut ::std::os::raw::c_short,
        _Mask: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedOr64(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _interlockedor64(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedOr8(
        _Value: *mut ::std::os::raw::c_char,
        _Mask: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn _InterlockedXor(
        _Value: *mut ::std::os::raw::c_long,
        _Mask: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedXor16(
        _Value: *mut ::std::os::raw::c_short,
        _Mask: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _InterlockedXor64(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _interlockedxor64(
        _Value: *mut ::std::os::raw::c_longlong,
        _Mask: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedXor8(
        _Value: *mut ::std::os::raw::c_char,
        _Mask: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn _ReadWriteBarrier();
}
extern "C" {
    pub fn __iso_volatile_load16(arg1: *const ::std::os::raw::c_short) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn __iso_volatile_load32(arg1: *const ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iso_volatile_load64(
        arg1: *const ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __iso_volatile_load8(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_char;
}
extern "C" {
    pub fn __iso_volatile_store16(
        arg1: *mut ::std::os::raw::c_short,
        arg2: ::std::os::raw::c_short,
    );
}
extern "C" {
    pub fn __iso_volatile_store32(arg1: *mut ::std::os::raw::c_int, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn __iso_volatile_store64(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn __iso_volatile_store8(arg1: *mut ::std::os::raw::c_char, arg2: ::std::os::raw::c_char);
}
extern "C" {
    pub fn _mm_pause();
}
extern "C" {
    pub fn __lzcnt(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __lzcnt16(arg1: ::std::os::raw::c_ushort) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn __lzcnt64(arg1: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __popcnt(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __popcnt16(arg1: ::std::os::raw::c_ushort) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn __popcnt64(arg1: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _rotl(
        _Value: ::std::os::raw::c_uint,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _rotl16(
        _Value: ::std::os::raw::c_ushort,
        _Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn _rotl64(
        _Value: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _rotl8(
        _Value: ::std::os::raw::c_uchar,
        _Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _rotr(
        _Value: ::std::os::raw::c_uint,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _rotr16(
        _Value: ::std::os::raw::c_ushort,
        _Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn _rotr64(
        _Value: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _rotr8(
        _Value: ::std::os::raw::c_uchar,
        _Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn __shiftleft128(
        _LowPart: ::std::os::raw::c_ulonglong,
        _HighPart: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn __shiftright128(
        _LowPart: ::std::os::raw::c_ulonglong,
        _HighPart: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _umul128(
        _Multiplier: ::std::os::raw::c_ulonglong,
        _Multiplicand: ::std::os::raw::c_ulonglong,
        _HighProduct: *mut ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _udiv128(
        _HighDividend: ::std::os::raw::c_ulonglong,
        _LowDividend: ::std::os::raw::c_ulonglong,
        _Divisor: ::std::os::raw::c_ulonglong,
        _Remainder: *mut ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _addcarry_u64(
        arg1: ::std::os::raw::c_uchar,
        arg2: ::std::os::raw::c_ulonglong,
        arg3: ::std::os::raw::c_ulonglong,
        arg4: *mut ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _subborrow_u64(
        arg1: ::std::os::raw::c_uchar,
        arg2: ::std::os::raw::c_ulonglong,
        arg3: ::std::os::raw::c_ulonglong,
        arg4: *mut ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn __ceil(arg1: f64) -> f64;
}
extern "C" {
    pub fn __ceilf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __floor(arg1: f64) -> f64;
}
extern "C" {
    pub fn __floorf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __round(arg1: f64) -> f64;
}
extern "C" {
    pub fn __roundf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __trunc(arg1: f64) -> f64;
}
extern "C" {
    pub fn __truncf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __copysign(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn __copysignf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn __signbitvalue(arg1: f64) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn __signbitvaluef(arg1: f32) -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _SETJMP_FLOAT128 {
    pub Part: [::std::os::raw::c_ulonglong; 2usize],
}
#[test]
fn bindgen_test_layout__SETJMP_FLOAT128() {
    const UNINIT: ::std::mem::MaybeUninit<_SETJMP_FLOAT128> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_SETJMP_FLOAT128>(),
        16usize,
        concat!("Size of: ", stringify!(_SETJMP_FLOAT128))
    );
    assert_eq!(
        ::std::mem::align_of::<_SETJMP_FLOAT128>(),
        16usize,
        concat!("Alignment of ", stringify!(_SETJMP_FLOAT128))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Part) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SETJMP_FLOAT128),
            "::",
            stringify!(Part)
        )
    );
}
pub type SETJMP_FLOAT128 = _SETJMP_FLOAT128;
pub type _JBTYPE = SETJMP_FLOAT128;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _JUMP_BUFFER {
    pub Frame: ::std::os::raw::c_ulonglong,
    pub Rbx: ::std::os::raw::c_ulonglong,
    pub Rsp: ::std::os::raw::c_ulonglong,
    pub Rbp: ::std::os::raw::c_ulonglong,
    pub Rsi: ::std::os::raw::c_ulonglong,
    pub Rdi: ::std::os::raw::c_ulonglong,
    pub R12: ::std::os::raw::c_ulonglong,
    pub R13: ::std::os::raw::c_ulonglong,
    pub R14: ::std::os::raw::c_ulonglong,
    pub R15: ::std::os::raw::c_ulonglong,
    pub Rip: ::std::os::raw::c_ulonglong,
    pub MxCsr: ::std::os::raw::c_ulong,
    pub FpCsr: ::std::os::raw::c_ushort,
    pub Spare: ::std::os::raw::c_ushort,
    pub Xmm6: SETJMP_FLOAT128,
    pub Xmm7: SETJMP_FLOAT128,
    pub Xmm8: SETJMP_FLOAT128,
    pub Xmm9: SETJMP_FLOAT128,
    pub Xmm10: SETJMP_FLOAT128,
    pub Xmm11: SETJMP_FLOAT128,
    pub Xmm12: SETJMP_FLOAT128,
    pub Xmm13: SETJMP_FLOAT128,
    pub Xmm14: SETJMP_FLOAT128,
    pub Xmm15: SETJMP_FLOAT128,
}
#[test]
fn bindgen_test_layout__JUMP_BUFFER() {
    const UNINIT: ::std::mem::MaybeUninit<_JUMP_BUFFER> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_JUMP_BUFFER>(),
        256usize,
        concat!("Size of: ", stringify!(_JUMP_BUFFER))
    );
    assert_eq!(
        ::std::mem::align_of::<_JUMP_BUFFER>(),
        16usize,
        concat!("Alignment of ", stringify!(_JUMP_BUFFER))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Frame) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Frame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rbx) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Rbx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rsp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Rsp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rbp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Rbp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rsi) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Rsi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rdi) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Rdi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).R12) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(R12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).R13) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(R13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).R14) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(R14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).R15) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(R15)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Rip) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Rip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MxCsr) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(MxCsr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).FpCsr) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(FpCsr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Spare) as usize - ptr as usize },
        94usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Spare)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm6) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Xmm6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm7) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Xmm7)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm8) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Xmm8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm9) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Xmm9)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm10) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Xmm10)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm11) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Xmm11)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm12) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Xmm12)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm13) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Xmm13)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm14) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Xmm14)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Xmm15) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_JUMP_BUFFER),
            "::",
            stringify!(Xmm15)
        )
    );
}
pub type jmp_buf = [_JBTYPE; 16usize];
extern "C" {
    pub fn _setjmp(_Buf: *mut _JBTYPE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn longjmp(_Buf: *mut _JBTYPE, _Value: ::std::os::raw::c_int) -> !;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __m64 {
    pub m64_u64: ::std::os::raw::c_ulonglong,
    pub m64_f32: [f32; 2usize],
    pub m64_i8: [::std::os::raw::c_char; 8usize],
    pub m64_i16: [::std::os::raw::c_short; 4usize],
    pub m64_i32: [::std::os::raw::c_int; 2usize],
    pub m64_i64: ::std::os::raw::c_longlong,
    pub m64_u8: [::std::os::raw::c_uchar; 8usize],
    pub m64_u16: [::std::os::raw::c_ushort; 4usize],
    pub m64_u32: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___m64() {
    const UNINIT: ::std::mem::MaybeUninit<__m64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__m64>(),
        8usize,
        concat!("Size of: ", stringify!(__m64))
    );
    assert_eq!(
        ::std::mem::align_of::<__m64>(),
        8usize,
        concat!("Alignment of ", stringify!(__m64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m64_u64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m64),
            "::",
            stringify!(m64_u64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m64_f32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m64),
            "::",
            stringify!(m64_f32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m64_i8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m64),
            "::",
            stringify!(m64_i8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m64_i16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m64),
            "::",
            stringify!(m64_i16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m64_i32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m64),
            "::",
            stringify!(m64_i32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m64_i64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m64),
            "::",
            stringify!(m64_i64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m64_u8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m64),
            "::",
            stringify!(m64_u8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m64_u16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m64),
            "::",
            stringify!(m64_u16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m64_u32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m64),
            "::",
            stringify!(m64_u32)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union __m128 {
    pub m128_f32: [f32; 4usize],
    pub m128_u64: [::std::os::raw::c_ulonglong; 2usize],
    pub m128_i8: [::std::os::raw::c_char; 16usize],
    pub m128_i16: [::std::os::raw::c_short; 8usize],
    pub m128_i32: [::std::os::raw::c_int; 4usize],
    pub m128_i64: [::std::os::raw::c_longlong; 2usize],
    pub m128_u8: [::std::os::raw::c_uchar; 16usize],
    pub m128_u16: [::std::os::raw::c_ushort; 8usize],
    pub m128_u32: [::std::os::raw::c_uint; 4usize],
}
#[test]
fn bindgen_test_layout___m128() {
    const UNINIT: ::std::mem::MaybeUninit<__m128> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__m128>(),
        16usize,
        concat!("Size of: ", stringify!(__m128))
    );
    assert_eq!(
        ::std::mem::align_of::<__m128>(),
        16usize,
        concat!("Alignment of ", stringify!(__m128))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128_f32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128),
            "::",
            stringify!(m128_f32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128_u64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128),
            "::",
            stringify!(m128_u64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128_i8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128),
            "::",
            stringify!(m128_i8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128_i16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128),
            "::",
            stringify!(m128_i16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128_i32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128),
            "::",
            stringify!(m128_i32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128_i64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128),
            "::",
            stringify!(m128_i64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128_u8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128),
            "::",
            stringify!(m128_u8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128_u16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128),
            "::",
            stringify!(m128_u16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128_u32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128),
            "::",
            stringify!(m128_u32)
        )
    );
}
extern "C" {
    pub fn _calloc_base(_Count: usize, _Size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        _Count: ::std::os::raw::c_ulonglong,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _callnewh(_Size: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _expand(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _free_base(_Block: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn free(_Block: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _malloc_base(_Size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn malloc(_Size: ::std::os::raw::c_ulonglong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _msize_base(_Block: *mut ::std::os::raw::c_void) -> usize;
}
extern "C" {
    pub fn _msize(_Block: *mut ::std::os::raw::c_void) -> usize;
}
extern "C" {
    pub fn _realloc_base(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _recalloc_base(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_free(_Block: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _aligned_malloc(_Size: usize, _Alignment: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_offset_malloc(
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_msize(
        _Block: *mut ::std::os::raw::c_void,
        _Alignment: usize,
        _Offset: usize,
    ) -> usize;
}
extern "C" {
    pub fn _aligned_offset_realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_offset_recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
        _Alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
        _Alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _heapinfo {
    pub _pentry: *mut ::std::os::raw::c_int,
    pub _size: usize,
    pub _useflag: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__heapinfo() {
    const UNINIT: ::std::mem::MaybeUninit<_heapinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_heapinfo>(),
        24usize,
        concat!("Size of: ", stringify!(_heapinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<_heapinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(_heapinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pentry) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_heapinfo),
            "::",
            stringify!(_pentry)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_heapinfo),
            "::",
            stringify!(_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._useflag) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_heapinfo),
            "::",
            stringify!(_useflag)
        )
    );
}
pub type _HEAPINFO = _heapinfo;
extern "C" {
    pub fn _alloca(_Size: ::std::os::raw::c_ulonglong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _get_heap_handle() -> isize;
}
extern "C" {
    pub fn _heapmin() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _heapwalk(_EntryInfo: *mut _HEAPINFO) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _heapchk() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _resetstkoflw() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_add_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_add_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_sub_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_sub_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_mul_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_mul_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_div_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_div_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_sqrt_ss(_A: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_sqrt_ps(_A: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_rcp_ss(_A: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_rcp_ps(_A: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_rsqrt_ss(_A: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_rsqrt_ps(_A: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_min_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_min_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_max_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_max_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_and_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_andnot_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_or_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_xor_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpeq_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpeq_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmplt_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmplt_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmple_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmple_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpgt_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpgt_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpge_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpge_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpneq_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpneq_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpnlt_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpnlt_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpnle_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpnle_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpngt_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpngt_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpnge_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpnge_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpord_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpord_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpunord_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cmpunord_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_comieq_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_comilt_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_comile_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_comigt_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_comige_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_comineq_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomieq_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomilt_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomile_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomigt_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomige_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomineq_ss(_A: __m128, _B: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cvt_ss2si(_A: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cvtt_ss2si(_A: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cvt_si2ss(arg1: __m128, arg2: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm_cvtss_f32(_A: __m128) -> f32;
}
extern "C" {
    pub fn _mm_cvtss_si64(_A: __m128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _mm_cvttss_si64(_A: __m128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _mm_cvtsi64_ss(_A: __m128, _B: ::std::os::raw::c_longlong) -> __m128;
}
extern "C" {
    pub fn _mm_shuffle_ps(_A: __m128, _B: __m128, _Imm8: ::std::os::raw::c_uint) -> __m128;
}
extern "C" {
    pub fn _mm_unpackhi_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_unpacklo_ps(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_loadh_pi(arg1: __m128, arg2: *const __m64) -> __m128;
}
extern "C" {
    pub fn _mm_movehl_ps(arg1: __m128, arg2: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_movelh_ps(arg1: __m128, arg2: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_storeh_pi(arg1: *mut __m64, arg2: __m128);
}
extern "C" {
    pub fn _mm_loadl_pi(arg1: __m128, arg2: *const __m64) -> __m128;
}
extern "C" {
    pub fn _mm_storel_pi(arg1: *mut __m64, arg2: __m128);
}
extern "C" {
    pub fn _mm_movemask_ps(_A: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_set_ss(_A: f32) -> __m128;
}
extern "C" {
    pub fn _mm_set_ps1(_A: f32) -> __m128;
}
extern "C" {
    pub fn _mm_set_ps(_A: f32, _B: f32, _C: f32, _D: f32) -> __m128;
}
extern "C" {
    pub fn _mm_setr_ps(_A: f32, _B: f32, _C: f32, _D: f32) -> __m128;
}
extern "C" {
    pub fn _mm_setzero_ps() -> __m128;
}
extern "C" {
    pub fn _mm_load_ss(_A: *const f32) -> __m128;
}
extern "C" {
    pub fn _mm_load_ps1(_A: *const f32) -> __m128;
}
extern "C" {
    pub fn _mm_load_ps(_A: *const f32) -> __m128;
}
extern "C" {
    pub fn _mm_loadr_ps(_A: *const f32) -> __m128;
}
extern "C" {
    pub fn _mm_loadu_ps(_A: *const f32) -> __m128;
}
extern "C" {
    pub fn _mm_store_ss(_V: *mut f32, _A: __m128);
}
extern "C" {
    pub fn _mm_store_ps1(_V: *mut f32, _A: __m128);
}
extern "C" {
    pub fn _mm_store_ps(_V: *mut f32, _A: __m128);
}
extern "C" {
    pub fn _mm_storer_ps(_V: *mut f32, _A: __m128);
}
extern "C" {
    pub fn _mm_storeu_ps(_V: *mut f32, _A: __m128);
}
extern "C" {
    pub fn _mm_prefetch(_A: *const ::std::os::raw::c_char, _Sel: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _mm_stream_ps(arg1: *mut f32, arg2: __m128);
}
extern "C" {
    pub fn _mm_move_ss(_A: __m128, _B: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_sfence();
}
extern "C" {
    pub fn _mm_getcsr() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _mm_setcsr(arg1: ::std::os::raw::c_uint);
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union __m128i {
    pub m128i_i8: [::std::os::raw::c_char; 16usize],
    pub m128i_i16: [::std::os::raw::c_short; 8usize],
    pub m128i_i32: [::std::os::raw::c_int; 4usize],
    pub m128i_i64: [::std::os::raw::c_longlong; 2usize],
    pub m128i_u8: [::std::os::raw::c_uchar; 16usize],
    pub m128i_u16: [::std::os::raw::c_ushort; 8usize],
    pub m128i_u32: [::std::os::raw::c_uint; 4usize],
    pub m128i_u64: [::std::os::raw::c_ulonglong; 2usize],
}
#[test]
fn bindgen_test_layout___m128i() {
    const UNINIT: ::std::mem::MaybeUninit<__m128i> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__m128i>(),
        16usize,
        concat!("Size of: ", stringify!(__m128i))
    );
    assert_eq!(
        ::std::mem::align_of::<__m128i>(),
        16usize,
        concat!("Alignment of ", stringify!(__m128i))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128i_i8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128i),
            "::",
            stringify!(m128i_i8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128i_i16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128i),
            "::",
            stringify!(m128i_i16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128i_i32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128i),
            "::",
            stringify!(m128i_i32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128i_i64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128i),
            "::",
            stringify!(m128i_i64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128i_u8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128i),
            "::",
            stringify!(m128i_u8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128i_u16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128i),
            "::",
            stringify!(m128i_u16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128i_u32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128i),
            "::",
            stringify!(m128i_u32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128i_u64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128i),
            "::",
            stringify!(m128i_u64)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct __m128d {
    pub m128d_f64: [f64; 2usize],
}
#[test]
fn bindgen_test_layout___m128d() {
    const UNINIT: ::std::mem::MaybeUninit<__m128d> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__m128d>(),
        16usize,
        concat!("Size of: ", stringify!(__m128d))
    );
    assert_eq!(
        ::std::mem::align_of::<__m128d>(),
        16usize,
        concat!("Alignment of ", stringify!(__m128d))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m128d_f64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m128d),
            "::",
            stringify!(m128d_f64)
        )
    );
}
extern "C" {
    pub fn _mm_add_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_add_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_sub_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_sub_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_mul_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_mul_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_sqrt_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_sqrt_pd(_A: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_div_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_div_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_min_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_min_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_max_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_max_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_and_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_andnot_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_or_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_xor_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpeq_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpeq_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmplt_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmplt_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmple_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmple_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpgt_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpgt_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpge_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpge_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpneq_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpneq_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpnlt_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpnlt_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpnle_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpnle_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpngt_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpngt_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpnge_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpnge_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpord_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpord_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpunord_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpunord_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_comieq_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_comilt_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_comile_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_comigt_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_comige_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_comineq_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomieq_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomilt_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomile_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomigt_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomige_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_ucomineq_sd(_A: __m128d, _B: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cvtepi32_pd(_A: __m128i) -> __m128d;
}
extern "C" {
    pub fn _mm_cvtpd_epi32(_A: __m128d) -> __m128i;
}
extern "C" {
    pub fn _mm_cvttpd_epi32(_A: __m128d) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepi32_ps(_A: __m128i) -> __m128;
}
extern "C" {
    pub fn _mm_cvtps_epi32(_A: __m128) -> __m128i;
}
extern "C" {
    pub fn _mm_cvttps_epi32(_A: __m128) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtpd_ps(_A: __m128d) -> __m128;
}
extern "C" {
    pub fn _mm_cvtps_pd(_A: __m128) -> __m128d;
}
extern "C" {
    pub fn _mm_cvtsd_ss(_A: __m128, _B: __m128d) -> __m128;
}
extern "C" {
    pub fn _mm_cvtss_sd(_A: __m128d, _B: __m128) -> __m128d;
}
extern "C" {
    pub fn _mm_cvtsd_si32(_A: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cvttsd_si32(_A: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cvtsi32_sd(_A: __m128d, _B: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm_unpackhi_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_unpacklo_pd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_movemask_pd(_A: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_shuffle_pd(_A: __m128d, _B: __m128d, _I: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm_load_pd(_Dp: *const f64) -> __m128d;
}
extern "C" {
    pub fn _mm_load1_pd(_Dp: *const f64) -> __m128d;
}
extern "C" {
    pub fn _mm_loadr_pd(_Dp: *const f64) -> __m128d;
}
extern "C" {
    pub fn _mm_loadu_pd(_Dp: *const f64) -> __m128d;
}
extern "C" {
    pub fn _mm_load_sd(_Dp: *const f64) -> __m128d;
}
extern "C" {
    pub fn _mm_loadh_pd(_A: __m128d, _Dp: *const f64) -> __m128d;
}
extern "C" {
    pub fn _mm_loadl_pd(_A: __m128d, _Dp: *const f64) -> __m128d;
}
extern "C" {
    pub fn _mm_set_sd(_W: f64) -> __m128d;
}
extern "C" {
    pub fn _mm_set1_pd(_A: f64) -> __m128d;
}
extern "C" {
    pub fn _mm_set_pd(_Z: f64, _Y: f64) -> __m128d;
}
extern "C" {
    pub fn _mm_setr_pd(_Y: f64, _Z: f64) -> __m128d;
}
extern "C" {
    pub fn _mm_setzero_pd() -> __m128d;
}
extern "C" {
    pub fn _mm_move_sd(_A: __m128d, _B: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_store_sd(_Dp: *mut f64, _A: __m128d);
}
extern "C" {
    pub fn _mm_store1_pd(_Dp: *mut f64, _A: __m128d);
}
extern "C" {
    pub fn _mm_store_pd(_Dp: *mut f64, _A: __m128d);
}
extern "C" {
    pub fn _mm_storeu_pd(_Dp: *mut f64, _A: __m128d);
}
extern "C" {
    pub fn _mm_storer_pd(_Dp: *mut f64, _A: __m128d);
}
extern "C" {
    pub fn _mm_storeh_pd(_Dp: *mut f64, _A: __m128d);
}
extern "C" {
    pub fn _mm_storel_pd(_Dp: *mut f64, _A: __m128d);
}
extern "C" {
    pub fn _mm_add_epi8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_add_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_add_epi32(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_add_epi64(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_adds_epi8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_adds_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_adds_epu8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_adds_epu16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_avg_epu8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_avg_epu16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_madd_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_max_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_max_epu8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_min_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_min_epu8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_mulhi_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_mulhi_epu16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_mullo_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_mul_epu32(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sad_epu8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sub_epi8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sub_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sub_epi32(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sub_epi64(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_subs_epi8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_subs_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_subs_epu8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_subs_epu16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_and_si128(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_andnot_si128(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_or_si128(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_xor_si128(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_slli_si128(_A: __m128i, _Imm: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_slli_epi16(_A: __m128i, _Count: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_sll_epi16(_A: __m128i, _Count: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_slli_epi32(_A: __m128i, _Count: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_sll_epi32(_A: __m128i, _Count: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_slli_epi64(_A: __m128i, _Count: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_sll_epi64(_A: __m128i, _Count: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_srai_epi16(_A: __m128i, _Count: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_sra_epi16(_A: __m128i, _Count: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_srai_epi32(_A: __m128i, _Count: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_sra_epi32(_A: __m128i, _Count: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_srli_si128(_A: __m128i, _Imm: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_srli_epi16(_A: __m128i, _Count: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_srl_epi16(_A: __m128i, _Count: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_srli_epi32(_A: __m128i, _Count: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_srl_epi32(_A: __m128i, _Count: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_srli_epi64(_A: __m128i, _Count: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_srl_epi64(_A: __m128i, _Count: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cmpeq_epi8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cmpeq_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cmpeq_epi32(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cmpgt_epi8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cmpgt_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cmpgt_epi32(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cmplt_epi8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cmplt_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cmplt_epi32(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtsi32_si128(_A: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtsi128_si32(_A: __m128i) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_packs_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_packs_epi32(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_packus_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_extract_epi16(_A: __m128i, _Imm: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_insert_epi16(
        _A: __m128i,
        _B: ::std::os::raw::c_int,
        _Imm: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_movemask_epi8(_A: __m128i) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_shuffle_epi32(_A: __m128i, _Imm: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_shufflehi_epi16(_A: __m128i, _Imm: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_shufflelo_epi16(_A: __m128i, _Imm: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_unpackhi_epi8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_unpackhi_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_unpackhi_epi32(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_unpackhi_epi64(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_unpacklo_epi8(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_unpacklo_epi16(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_unpacklo_epi32(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_unpacklo_epi64(_A: __m128i, _B: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_load_si128(_P: *const __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_loadu_si128(_P: *const __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_loadl_epi64(_P: *const __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_set_epi64x(
        _I1: ::std::os::raw::c_longlong,
        _I0: ::std::os::raw::c_longlong,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_set_epi32(
        _I3: ::std::os::raw::c_int,
        _I2: ::std::os::raw::c_int,
        _I1: ::std::os::raw::c_int,
        _I0: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_set_epi16(
        _W7: ::std::os::raw::c_short,
        _W6: ::std::os::raw::c_short,
        _W5: ::std::os::raw::c_short,
        _W4: ::std::os::raw::c_short,
        _W3: ::std::os::raw::c_short,
        _W2: ::std::os::raw::c_short,
        _W1: ::std::os::raw::c_short,
        _W0: ::std::os::raw::c_short,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_set_epi8(
        _B15: ::std::os::raw::c_char,
        _B14: ::std::os::raw::c_char,
        _B13: ::std::os::raw::c_char,
        _B12: ::std::os::raw::c_char,
        _B11: ::std::os::raw::c_char,
        _B10: ::std::os::raw::c_char,
        _B9: ::std::os::raw::c_char,
        _B8: ::std::os::raw::c_char,
        _B7: ::std::os::raw::c_char,
        _B6: ::std::os::raw::c_char,
        _B5: ::std::os::raw::c_char,
        _B4: ::std::os::raw::c_char,
        _B3: ::std::os::raw::c_char,
        _B2: ::std::os::raw::c_char,
        _B1: ::std::os::raw::c_char,
        _B0: ::std::os::raw::c_char,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_set1_epi64x(i: ::std::os::raw::c_longlong) -> __m128i;
}
extern "C" {
    pub fn _mm_set1_epi32(_I: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_set1_epi16(_W: ::std::os::raw::c_short) -> __m128i;
}
extern "C" {
    pub fn _mm_set1_epi8(_B: ::std::os::raw::c_char) -> __m128i;
}
extern "C" {
    pub fn _mm_setl_epi64(_Q: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_setr_epi32(
        _I0: ::std::os::raw::c_int,
        _I1: ::std::os::raw::c_int,
        _I2: ::std::os::raw::c_int,
        _I3: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_setr_epi16(
        _W0: ::std::os::raw::c_short,
        _W1: ::std::os::raw::c_short,
        _W2: ::std::os::raw::c_short,
        _W3: ::std::os::raw::c_short,
        _W4: ::std::os::raw::c_short,
        _W5: ::std::os::raw::c_short,
        _W6: ::std::os::raw::c_short,
        _W7: ::std::os::raw::c_short,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_setr_epi8(
        _B15: ::std::os::raw::c_char,
        _B14: ::std::os::raw::c_char,
        _B13: ::std::os::raw::c_char,
        _B12: ::std::os::raw::c_char,
        _B11: ::std::os::raw::c_char,
        _B10: ::std::os::raw::c_char,
        _B9: ::std::os::raw::c_char,
        _B8: ::std::os::raw::c_char,
        _B7: ::std::os::raw::c_char,
        _B6: ::std::os::raw::c_char,
        _B5: ::std::os::raw::c_char,
        _B4: ::std::os::raw::c_char,
        _B3: ::std::os::raw::c_char,
        _B2: ::std::os::raw::c_char,
        _B1: ::std::os::raw::c_char,
        _B0: ::std::os::raw::c_char,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_setzero_si128() -> __m128i;
}
extern "C" {
    pub fn _mm_store_si128(_P: *mut __m128i, _B: __m128i);
}
extern "C" {
    pub fn _mm_storeu_si128(_P: *mut __m128i, _B: __m128i);
}
extern "C" {
    pub fn _mm_storel_epi64(_P: *mut __m128i, _Q: __m128i);
}
extern "C" {
    pub fn _mm_maskmoveu_si128(_D: __m128i, _N: __m128i, _P: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn _mm_move_epi64(_Q: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_stream_pd(_Dp: *mut f64, _A: __m128d);
}
extern "C" {
    pub fn _mm_stream_si128(_P: *mut __m128i, _A: __m128i);
}
extern "C" {
    pub fn _mm_clflush(_P: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn _mm_lfence();
}
extern "C" {
    pub fn _mm_mfence();
}
extern "C" {
    pub fn _mm_stream_si32(_P: *mut ::std::os::raw::c_int, _I: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _mm_cvtsd_f64(_A: __m128d) -> f64;
}
extern "C" {
    pub fn _mm_castpd_ps(arg1: __m128d) -> __m128;
}
extern "C" {
    pub fn _mm_castpd_si128(arg1: __m128d) -> __m128i;
}
extern "C" {
    pub fn _mm_castps_pd(arg1: __m128) -> __m128d;
}
extern "C" {
    pub fn _mm_castps_si128(arg1: __m128) -> __m128i;
}
extern "C" {
    pub fn _mm_castsi128_ps(arg1: __m128i) -> __m128;
}
extern "C" {
    pub fn _mm_castsi128_pd(arg1: __m128i) -> __m128d;
}
extern "C" {
    pub fn _mm_cvtsd_si64(arg1: __m128d) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _mm_cvttsd_si64(arg1: __m128d) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _mm_cvtsi64_sd(arg1: __m128d, arg2: ::std::os::raw::c_longlong) -> __m128d;
}
extern "C" {
    pub fn _mm_cvtsi64_si128(arg1: ::std::os::raw::c_longlong) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtsi128_si64(arg1: __m128i) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _mm_addsub_ps(arg1: __m128, arg2: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_hadd_ps(arg1: __m128, arg2: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_hsub_ps(arg1: __m128, arg2: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_movehdup_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_moveldup_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_addsub_pd(arg1: __m128d, arg2: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_hadd_pd(arg1: __m128d, arg2: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_hsub_pd(arg1: __m128d, arg2: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_loaddup_pd(arg1: *const f64) -> __m128d;
}
extern "C" {
    pub fn _mm_movedup_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_lddqu_si128(arg1: *const __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_monitor(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_uint,
        arg3: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn _mm_mwait(arg1: ::std::os::raw::c_uint, arg2: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _mm_hadd_epi16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_hadd_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_hadds_epi16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_hsub_epi16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_hsub_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_hsubs_epi16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_maddubs_epi16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_mulhrs_epi16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_shuffle_epi8(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sign_epi8(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sign_epi16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sign_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_alignr_epi8(arg1: __m128i, arg2: __m128i, arg3: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_abs_epi8(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_abs_epi16(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_abs_epi32(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_blend_epi16(arg1: __m128i, arg2: __m128i, arg3: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_blendv_epi8(arg1: __m128i, arg2: __m128i, mask: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_blend_ps(arg1: __m128, arg2: __m128, arg3: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm_blendv_ps(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_blend_pd(arg1: __m128d, arg2: __m128d, arg3: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm_blendv_pd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_dp_ps(arg1: __m128, arg2: __m128, arg3: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm_dp_pd(arg1: __m128d, arg2: __m128d, arg3: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm_cmpeq_epi64(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_min_epi8(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_max_epi8(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_min_epu16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_max_epu16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_min_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_max_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_min_epu32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_max_epu32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_mullo_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_mul_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_testz_si128(arg1: __m128i, arg2: __m128i) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_testc_si128(arg1: __m128i, arg2: __m128i) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_testnzc_si128(arg1: __m128i, arg2: __m128i) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_insert_ps(arg1: __m128, arg2: __m128, arg3: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm_extract_ps(arg1: __m128, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_insert_epi8(
        arg1: __m128i,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_insert_epi32(
        arg1: __m128i,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_insert_epi64(
        arg1: __m128i,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_extract_epi8(arg1: __m128i, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_extract_epi32(arg1: __m128i, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_extract_epi64(
        arg1: __m128i,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _mm_minpos_epu16(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_round_pd(arg1: __m128d, arg2: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm_round_sd(arg1: __m128d, arg2: __m128d, arg3: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm_round_ps(arg1: __m128, arg2: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm_round_ss(arg1: __m128, arg2: __m128, arg3: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm_cvtepi8_epi32(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepi16_epi32(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepi8_epi64(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepi32_epi64(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepi16_epi64(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepi8_epi16(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepu8_epi32(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepu16_epi32(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepu8_epi64(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepu32_epi64(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepu16_epi64(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cvtepu8_epi16(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_packus_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_mpsadbw_epu8(arg1: __m128i, arg2: __m128i, arg3: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_stream_load_si128(arg1: *const __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_cmpistrm(arg1: __m128i, arg2: __m128i, arg3: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_cmpistri(
        arg1: __m128i,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpestrm(
        arg1: __m128i,
        arg2: ::std::os::raw::c_int,
        arg3: __m128i,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_cmpestri(
        arg1: __m128i,
        arg2: ::std::os::raw::c_int,
        arg3: __m128i,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpistrz(
        arg1: __m128i,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpistrc(
        arg1: __m128i,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpistrs(
        arg1: __m128i,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpistro(
        arg1: __m128i,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpistra(
        arg1: __m128i,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpestrz(
        arg1: __m128i,
        arg2: ::std::os::raw::c_int,
        arg3: __m128i,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpestrc(
        arg1: __m128i,
        arg2: ::std::os::raw::c_int,
        arg3: __m128i,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpestrs(
        arg1: __m128i,
        arg2: ::std::os::raw::c_int,
        arg3: __m128i,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpestro(
        arg1: __m128i,
        arg2: ::std::os::raw::c_int,
        arg3: __m128i,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpestra(
        arg1: __m128i,
        arg2: ::std::os::raw::c_int,
        arg3: __m128i,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmpgt_epi64(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_popcnt_u32(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_popcnt_u64(arg1: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _mm_crc32_u8(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _mm_crc32_u16(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _mm_crc32_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _mm_crc32_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _mm_aesdec_si128(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_aesdeclast_si128(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_aesenc_si128(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_aesenclast_si128(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_aesimc_si128(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_aeskeygenassist_si128(arg1: __m128i, arg2: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm_clmulepi64_si128(
        arg1: __m128i,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m128i;
}
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union __m256 {
    pub m256_f32: [f32; 8usize],
}
#[test]
fn bindgen_test_layout___m256() {
    const UNINIT: ::std::mem::MaybeUninit<__m256> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__m256>(),
        32usize,
        concat!("Size of: ", stringify!(__m256))
    );
    assert_eq!(
        ::std::mem::align_of::<__m256>(),
        32usize,
        concat!("Alignment of ", stringify!(__m256))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m256_f32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m256),
            "::",
            stringify!(m256_f32)
        )
    );
}
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone)]
pub struct __m256d {
    pub m256d_f64: [f64; 4usize],
}
#[test]
fn bindgen_test_layout___m256d() {
    const UNINIT: ::std::mem::MaybeUninit<__m256d> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__m256d>(),
        32usize,
        concat!("Size of: ", stringify!(__m256d))
    );
    assert_eq!(
        ::std::mem::align_of::<__m256d>(),
        32usize,
        concat!("Alignment of ", stringify!(__m256d))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m256d_f64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m256d),
            "::",
            stringify!(m256d_f64)
        )
    );
}
#[repr(C)]
#[repr(align(32))]
#[derive(Copy, Clone)]
pub union __m256i {
    pub m256i_i8: [::std::os::raw::c_char; 32usize],
    pub m256i_i16: [::std::os::raw::c_short; 16usize],
    pub m256i_i32: [::std::os::raw::c_int; 8usize],
    pub m256i_i64: [::std::os::raw::c_longlong; 4usize],
    pub m256i_u8: [::std::os::raw::c_uchar; 32usize],
    pub m256i_u16: [::std::os::raw::c_ushort; 16usize],
    pub m256i_u32: [::std::os::raw::c_uint; 8usize],
    pub m256i_u64: [::std::os::raw::c_ulonglong; 4usize],
}
#[test]
fn bindgen_test_layout___m256i() {
    const UNINIT: ::std::mem::MaybeUninit<__m256i> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__m256i>(),
        32usize,
        concat!("Size of: ", stringify!(__m256i))
    );
    assert_eq!(
        ::std::mem::align_of::<__m256i>(),
        32usize,
        concat!("Alignment of ", stringify!(__m256i))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m256i_i8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m256i),
            "::",
            stringify!(m256i_i8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m256i_i16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m256i),
            "::",
            stringify!(m256i_i16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m256i_i32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m256i),
            "::",
            stringify!(m256i_i32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m256i_i64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m256i),
            "::",
            stringify!(m256i_i64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m256i_u8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m256i),
            "::",
            stringify!(m256i_u8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m256i_u16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m256i),
            "::",
            stringify!(m256i_u16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m256i_u32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m256i),
            "::",
            stringify!(m256i_u32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m256i_u64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m256i),
            "::",
            stringify!(m256i_u64)
        )
    );
}
extern "C" {
    pub fn _mm256_add_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_add_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_addsub_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_addsub_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_and_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_and_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_andnot_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_andnot_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_blend_pd(arg1: __m256d, arg2: __m256d, arg3: ::std::os::raw::c_int) -> __m256d;
}
extern "C" {
    pub fn _mm256_blend_ps(arg1: __m256, arg2: __m256, arg3: ::std::os::raw::c_int) -> __m256;
}
extern "C" {
    pub fn _mm256_blendv_pd(arg1: __m256d, arg2: __m256d, arg3: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_blendv_ps(arg1: __m256, arg2: __m256, arg3: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_div_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_div_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_dp_ps(arg1: __m256, arg2: __m256, arg3: ::std::os::raw::c_int) -> __m256;
}
extern "C" {
    pub fn _mm256_hadd_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_hadd_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_hsub_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_hsub_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_max_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_max_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_min_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_min_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_mul_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_mul_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_or_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_or_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_shuffle_pd(arg1: __m256d, arg2: __m256d, arg3: ::std::os::raw::c_int) -> __m256d;
}
extern "C" {
    pub fn _mm256_shuffle_ps(arg1: __m256, arg2: __m256, arg3: ::std::os::raw::c_int) -> __m256;
}
extern "C" {
    pub fn _mm256_sub_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_sub_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_xor_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_xor_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm_cmp_pd(arg1: __m128d, arg2: __m128d, arg3: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm256_cmp_pd(arg1: __m256d, arg2: __m256d, arg3: ::std::os::raw::c_int) -> __m256d;
}
extern "C" {
    pub fn _mm_cmp_ps(arg1: __m128, arg2: __m128, arg3: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm256_cmp_ps(arg1: __m256, arg2: __m256, arg3: ::std::os::raw::c_int) -> __m256;
}
extern "C" {
    pub fn _mm_cmp_sd(arg1: __m128d, arg2: __m128d, arg3: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm_comi_sd(
        arg1: __m128d,
        arg2: __m128d,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_cmp_ss(arg1: __m128, arg2: __m128, arg3: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm_comi_ss(
        arg1: __m128,
        arg2: __m128,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_cvtepi32_pd(arg1: __m128i) -> __m256d;
}
extern "C" {
    pub fn _mm256_cvtepi32_ps(arg1: __m256i) -> __m256;
}
extern "C" {
    pub fn _mm256_cvtpd_ps(arg1: __m256d) -> __m128;
}
extern "C" {
    pub fn _mm256_cvtps_epi32(arg1: __m256) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtps_pd(arg1: __m128) -> __m256d;
}
extern "C" {
    pub fn _mm256_cvttpd_epi32(arg1: __m256d) -> __m128i;
}
extern "C" {
    pub fn _mm256_cvtpd_epi32(arg1: __m256d) -> __m128i;
}
extern "C" {
    pub fn _mm256_cvttps_epi32(arg1: __m256) -> __m256i;
}
extern "C" {
    pub fn _mm256_extractf128_ps(arg1: __m256, arg2: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm256_extractf128_pd(arg1: __m256d, arg2: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm256_extractf128_si256(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm256_zeroall();
}
extern "C" {
    pub fn _mm256_zeroupper();
}
extern "C" {
    pub fn _mm256_permutevar_ps(arg1: __m256, arg2: __m256i) -> __m256;
}
extern "C" {
    pub fn _mm_permutevar_ps(arg1: __m128, arg2: __m128i) -> __m128;
}
extern "C" {
    pub fn _mm256_permute_ps(arg1: __m256, arg2: ::std::os::raw::c_int) -> __m256;
}
extern "C" {
    pub fn _mm_permute_ps(arg1: __m128, arg2: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm256_permutevar_pd(arg1: __m256d, arg2: __m256i) -> __m256d;
}
extern "C" {
    pub fn _mm_permutevar_pd(arg1: __m128d, arg2: __m128i) -> __m128d;
}
extern "C" {
    pub fn _mm256_permute_pd(arg1: __m256d, arg2: ::std::os::raw::c_int) -> __m256d;
}
extern "C" {
    pub fn _mm_permute_pd(arg1: __m128d, arg2: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm256_permute2f128_ps(
        arg1: __m256,
        arg2: __m256,
        arg3: ::std::os::raw::c_int,
    ) -> __m256;
}
extern "C" {
    pub fn _mm256_permute2f128_pd(
        arg1: __m256d,
        arg2: __m256d,
        arg3: ::std::os::raw::c_int,
    ) -> __m256d;
}
extern "C" {
    pub fn _mm256_permute2f128_si256(
        arg1: __m256i,
        arg2: __m256i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_broadcast_ss(arg1: *const f32) -> __m256;
}
extern "C" {
    pub fn _mm_broadcast_ss(arg1: *const f32) -> __m128;
}
extern "C" {
    pub fn _mm256_broadcast_sd(arg1: *const f64) -> __m256d;
}
extern "C" {
    pub fn _mm256_broadcast_ps(arg1: *const __m128) -> __m256;
}
extern "C" {
    pub fn _mm256_broadcast_pd(arg1: *const __m128d) -> __m256d;
}
extern "C" {
    pub fn _mm256_insertf128_ps(arg1: __m256, arg2: __m128, arg3: ::std::os::raw::c_int) -> __m256;
}
extern "C" {
    pub fn _mm256_insertf128_pd(
        arg1: __m256d,
        arg2: __m128d,
        arg3: ::std::os::raw::c_int,
    ) -> __m256d;
}
extern "C" {
    pub fn _mm256_insertf128_si256(
        arg1: __m256i,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_load_pd(arg1: *const f64) -> __m256d;
}
extern "C" {
    pub fn _mm256_store_pd(arg1: *mut f64, arg2: __m256d);
}
extern "C" {
    pub fn _mm256_load_ps(arg1: *const f32) -> __m256;
}
extern "C" {
    pub fn _mm256_store_ps(arg1: *mut f32, arg2: __m256);
}
extern "C" {
    pub fn _mm256_loadu_pd(arg1: *const f64) -> __m256d;
}
extern "C" {
    pub fn _mm256_storeu_pd(arg1: *mut f64, arg2: __m256d);
}
extern "C" {
    pub fn _mm256_loadu_ps(arg1: *const f32) -> __m256;
}
extern "C" {
    pub fn _mm256_storeu_ps(arg1: *mut f32, arg2: __m256);
}
extern "C" {
    pub fn _mm256_load_si256(arg1: *const __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_store_si256(arg1: *mut __m256i, arg2: __m256i);
}
extern "C" {
    pub fn _mm256_loadu_si256(arg1: *const __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_storeu_si256(arg1: *mut __m256i, arg2: __m256i);
}
extern "C" {
    pub fn _mm256_maskload_pd(arg1: *const f64, arg2: __m256i) -> __m256d;
}
extern "C" {
    pub fn _mm256_maskstore_pd(arg1: *mut f64, arg2: __m256i, arg3: __m256d);
}
extern "C" {
    pub fn _mm_maskload_pd(arg1: *const f64, arg2: __m128i) -> __m128d;
}
extern "C" {
    pub fn _mm_maskstore_pd(arg1: *mut f64, arg2: __m128i, arg3: __m128d);
}
extern "C" {
    pub fn _mm256_maskload_ps(arg1: *const f32, arg2: __m256i) -> __m256;
}
extern "C" {
    pub fn _mm256_maskstore_ps(arg1: *mut f32, arg2: __m256i, arg3: __m256);
}
extern "C" {
    pub fn _mm_maskload_ps(arg1: *const f32, arg2: __m128i) -> __m128;
}
extern "C" {
    pub fn _mm_maskstore_ps(arg1: *mut f32, arg2: __m128i, arg3: __m128);
}
extern "C" {
    pub fn _mm256_movehdup_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_moveldup_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_movedup_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_lddqu_si256(arg1: *const __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_stream_si256(arg1: *mut __m256i, arg2: __m256i);
}
extern "C" {
    pub fn _mm256_stream_pd(arg1: *mut f64, arg2: __m256d);
}
extern "C" {
    pub fn _mm256_stream_ps(arg1: *mut f32, arg2: __m256);
}
extern "C" {
    pub fn _mm256_rcp_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_rsqrt_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_sqrt_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_sqrt_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_round_pd(arg1: __m256d, arg2: ::std::os::raw::c_int) -> __m256d;
}
extern "C" {
    pub fn _mm256_round_ps(arg1: __m256, arg2: ::std::os::raw::c_int) -> __m256;
}
extern "C" {
    pub fn _mm256_unpackhi_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_unpackhi_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_unpacklo_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_unpacklo_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_testz_si256(arg1: __m256i, arg2: __m256i) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_testc_si256(arg1: __m256i, arg2: __m256i) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_testnzc_si256(arg1: __m256i, arg2: __m256i) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_testz_pd(arg1: __m256d, arg2: __m256d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_testc_pd(arg1: __m256d, arg2: __m256d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_testnzc_pd(arg1: __m256d, arg2: __m256d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_testz_pd(arg1: __m128d, arg2: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_testc_pd(arg1: __m128d, arg2: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_testnzc_pd(arg1: __m128d, arg2: __m128d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_testz_ps(arg1: __m256, arg2: __m256) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_testc_ps(arg1: __m256, arg2: __m256) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_testnzc_ps(arg1: __m256, arg2: __m256) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_testz_ps(arg1: __m128, arg2: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_testc_ps(arg1: __m128, arg2: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_testnzc_ps(arg1: __m128, arg2: __m128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_movemask_pd(arg1: __m256d) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_movemask_ps(arg1: __m256) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_setzero_pd() -> __m256d;
}
extern "C" {
    pub fn _mm256_setzero_ps() -> __m256;
}
extern "C" {
    pub fn _mm256_setzero_si256() -> __m256i;
}
extern "C" {
    pub fn _mm256_set_pd(arg1: f64, arg2: f64, arg3: f64, arg4: f64) -> __m256d;
}
extern "C" {
    pub fn _mm256_set_ps(
        arg1: f32,
        arg2: f32,
        arg3: f32,
        arg4: f32,
        arg5: f32,
        arg6: f32,
        arg7: f32,
        arg8: f32,
    ) -> __m256;
}
extern "C" {
    pub fn _mm256_set_epi8(
        arg1: ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_char,
        arg6: ::std::os::raw::c_char,
        arg7: ::std::os::raw::c_char,
        arg8: ::std::os::raw::c_char,
        arg9: ::std::os::raw::c_char,
        arg10: ::std::os::raw::c_char,
        arg11: ::std::os::raw::c_char,
        arg12: ::std::os::raw::c_char,
        arg13: ::std::os::raw::c_char,
        arg14: ::std::os::raw::c_char,
        arg15: ::std::os::raw::c_char,
        arg16: ::std::os::raw::c_char,
        arg17: ::std::os::raw::c_char,
        arg18: ::std::os::raw::c_char,
        arg19: ::std::os::raw::c_char,
        arg20: ::std::os::raw::c_char,
        arg21: ::std::os::raw::c_char,
        arg22: ::std::os::raw::c_char,
        arg23: ::std::os::raw::c_char,
        arg24: ::std::os::raw::c_char,
        arg25: ::std::os::raw::c_char,
        arg26: ::std::os::raw::c_char,
        arg27: ::std::os::raw::c_char,
        arg28: ::std::os::raw::c_char,
        arg29: ::std::os::raw::c_char,
        arg30: ::std::os::raw::c_char,
        arg31: ::std::os::raw::c_char,
        arg32: ::std::os::raw::c_char,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_set_epi16(
        arg1: ::std::os::raw::c_short,
        arg2: ::std::os::raw::c_short,
        arg3: ::std::os::raw::c_short,
        arg4: ::std::os::raw::c_short,
        arg5: ::std::os::raw::c_short,
        arg6: ::std::os::raw::c_short,
        arg7: ::std::os::raw::c_short,
        arg8: ::std::os::raw::c_short,
        arg9: ::std::os::raw::c_short,
        arg10: ::std::os::raw::c_short,
        arg11: ::std::os::raw::c_short,
        arg12: ::std::os::raw::c_short,
        arg13: ::std::os::raw::c_short,
        arg14: ::std::os::raw::c_short,
        arg15: ::std::os::raw::c_short,
        arg16: ::std::os::raw::c_short,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_set_epi32(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
        arg8: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_set_epi64x(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_longlong,
        arg4: ::std::os::raw::c_longlong,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_setr_pd(arg1: f64, arg2: f64, arg3: f64, arg4: f64) -> __m256d;
}
extern "C" {
    pub fn _mm256_setr_ps(
        arg1: f32,
        arg2: f32,
        arg3: f32,
        arg4: f32,
        arg5: f32,
        arg6: f32,
        arg7: f32,
        arg8: f32,
    ) -> __m256;
}
extern "C" {
    pub fn _mm256_setr_epi8(
        arg1: ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_char,
        arg6: ::std::os::raw::c_char,
        arg7: ::std::os::raw::c_char,
        arg8: ::std::os::raw::c_char,
        arg9: ::std::os::raw::c_char,
        arg10: ::std::os::raw::c_char,
        arg11: ::std::os::raw::c_char,
        arg12: ::std::os::raw::c_char,
        arg13: ::std::os::raw::c_char,
        arg14: ::std::os::raw::c_char,
        arg15: ::std::os::raw::c_char,
        arg16: ::std::os::raw::c_char,
        arg17: ::std::os::raw::c_char,
        arg18: ::std::os::raw::c_char,
        arg19: ::std::os::raw::c_char,
        arg20: ::std::os::raw::c_char,
        arg21: ::std::os::raw::c_char,
        arg22: ::std::os::raw::c_char,
        arg23: ::std::os::raw::c_char,
        arg24: ::std::os::raw::c_char,
        arg25: ::std::os::raw::c_char,
        arg26: ::std::os::raw::c_char,
        arg27: ::std::os::raw::c_char,
        arg28: ::std::os::raw::c_char,
        arg29: ::std::os::raw::c_char,
        arg30: ::std::os::raw::c_char,
        arg31: ::std::os::raw::c_char,
        arg32: ::std::os::raw::c_char,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_setr_epi16(
        arg1: ::std::os::raw::c_short,
        arg2: ::std::os::raw::c_short,
        arg3: ::std::os::raw::c_short,
        arg4: ::std::os::raw::c_short,
        arg5: ::std::os::raw::c_short,
        arg6: ::std::os::raw::c_short,
        arg7: ::std::os::raw::c_short,
        arg8: ::std::os::raw::c_short,
        arg9: ::std::os::raw::c_short,
        arg10: ::std::os::raw::c_short,
        arg11: ::std::os::raw::c_short,
        arg12: ::std::os::raw::c_short,
        arg13: ::std::os::raw::c_short,
        arg14: ::std::os::raw::c_short,
        arg15: ::std::os::raw::c_short,
        arg16: ::std::os::raw::c_short,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_setr_epi32(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
        arg8: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_setr_epi64x(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_longlong,
        arg4: ::std::os::raw::c_longlong,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_set1_pd(arg1: f64) -> __m256d;
}
extern "C" {
    pub fn _mm256_set1_ps(arg1: f32) -> __m256;
}
extern "C" {
    pub fn _mm256_set1_epi8(arg1: ::std::os::raw::c_char) -> __m256i;
}
extern "C" {
    pub fn _mm256_set1_epi16(arg1: ::std::os::raw::c_short) -> __m256i;
}
extern "C" {
    pub fn _mm256_set1_epi32(arg1: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_set1_epi64x(arg1: ::std::os::raw::c_longlong) -> __m256i;
}
extern "C" {
    pub fn _mm256_castpd_ps(arg1: __m256d) -> __m256;
}
extern "C" {
    pub fn _mm256_castps_pd(arg1: __m256) -> __m256d;
}
extern "C" {
    pub fn _mm256_castps_si256(arg1: __m256) -> __m256i;
}
extern "C" {
    pub fn _mm256_castpd_si256(arg1: __m256d) -> __m256i;
}
extern "C" {
    pub fn _mm256_castsi256_ps(arg1: __m256i) -> __m256;
}
extern "C" {
    pub fn _mm256_castsi256_pd(arg1: __m256i) -> __m256d;
}
extern "C" {
    pub fn _mm256_castps256_ps128(arg1: __m256) -> __m128;
}
extern "C" {
    pub fn _mm256_castpd256_pd128(arg1: __m256d) -> __m128d;
}
extern "C" {
    pub fn _mm256_castsi256_si128(arg1: __m256i) -> __m128i;
}
extern "C" {
    pub fn _mm256_castps128_ps256(arg1: __m128) -> __m256;
}
extern "C" {
    pub fn _mm256_castpd128_pd256(arg1: __m128d) -> __m256d;
}
extern "C" {
    pub fn _mm256_castsi128_si256(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm_cvtph_ps(arg1: __m128i) -> __m128;
}
extern "C" {
    pub fn _mm256_cvtph_ps(arg1: __m128i) -> __m256;
}
extern "C" {
    pub fn _mm_cvtps_ph(arg1: __m128, arg2: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm256_cvtps_ph(arg1: __m256, arg2: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _xgetbv(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _xsetbv(arg1: ::std::os::raw::c_uint, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xsave(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xsave64(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xsaveopt(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xsaveopt64(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xsavec(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xsavec64(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xrstor(arg1: *const ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xrstor64(arg1: *const ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xsaves(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xsaves64(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xrstors(arg1: *const ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _xrstors64(arg1: *const ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _fxsave(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _fxsave64(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _fxrstor(arg1: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn _fxrstor64(arg1: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn _rdrand16_step(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _rdrand32_step(arg1: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _rdrand64_step(arg1: *mut ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _readfsbase_u32() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _readgsbase_u32() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _readfsbase_u64() -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _readgsbase_u64() -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _writefsbase_u32(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _writegsbase_u32(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _writefsbase_u64(arg1: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _writegsbase_u64(arg1: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _mm_fmadd_ps(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fmadd_pd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_fmadd_ss(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fmadd_sd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_fmsub_ps(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fmsub_pd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_fmsub_ss(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fmsub_sd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_fnmadd_ps(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fnmadd_pd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_fnmadd_ss(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fnmadd_sd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_fnmsub_ps(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fnmsub_pd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_fnmsub_ss(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fnmsub_sd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_fmadd_ps(arg1: __m256, arg2: __m256, arg3: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_fmadd_pd(arg1: __m256d, arg2: __m256d, arg3: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_fmsub_ps(arg1: __m256, arg2: __m256, arg3: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_fmsub_pd(arg1: __m256d, arg2: __m256d, arg3: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_fnmadd_ps(arg1: __m256, arg2: __m256, arg3: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_fnmadd_pd(arg1: __m256d, arg2: __m256d, arg3: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_fnmsub_ps(arg1: __m256, arg2: __m256, arg3: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_fnmsub_pd(arg1: __m256d, arg2: __m256d, arg3: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_fmaddsub_ps(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fmaddsub_pd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_fmsubadd_ps(arg1: __m128, arg2: __m128, arg3: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fmsubadd_pd(arg1: __m128d, arg2: __m128d, arg3: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_fmaddsub_ps(arg1: __m256, arg2: __m256, arg3: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_fmaddsub_pd(arg1: __m256d, arg2: __m256d, arg3: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_fmsubadd_ps(arg1: __m256, arg2: __m256, arg3: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_fmsubadd_pd(arg1: __m256d, arg2: __m256d, arg3: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm256_cmpeq_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cmpeq_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cmpeq_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cmpeq_epi64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cmpgt_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cmpgt_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cmpgt_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cmpgt_epi64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_max_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_max_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_max_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_max_epu8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_max_epu16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_max_epu32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_min_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_min_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_min_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_min_epu8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_min_epu16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_min_epu32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_and_si256(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_andnot_si256(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_or_si256(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_xor_si256(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_abs_epi8(arg1: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_abs_epi16(arg1: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_abs_epi32(arg1: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_add_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_add_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_add_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_add_epi64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_adds_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_adds_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_adds_epu8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_adds_epu16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sub_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sub_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sub_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sub_epi64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_subs_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_subs_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_subs_epu8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_subs_epu16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_avg_epu8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_avg_epu16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_hadd_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_hadd_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_hadds_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_hsub_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_hsub_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_hsubs_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_madd_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_maddubs_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_mulhi_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_mulhi_epu16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_mullo_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_mullo_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_mul_epu32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_mul_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sign_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sign_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sign_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_mulhrs_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sad_epu8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_mpsadbw_epu8(
        arg1: __m256i,
        arg2: __m256i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_slli_si256(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_srli_si256(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_sll_epi16(arg1: __m256i, arg2: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sll_epi32(arg1: __m256i, arg2: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sll_epi64(arg1: __m256i, arg2: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_slli_epi16(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_slli_epi32(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_slli_epi64(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_sllv_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sllv_epi64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm_sllv_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sllv_epi64(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm256_sra_epi16(arg1: __m256i, arg2: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_sra_epi32(arg1: __m256i, arg2: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_srai_epi16(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_srai_epi32(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_srav_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm_srav_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm256_srl_epi16(arg1: __m256i, arg2: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_srl_epi32(arg1: __m256i, arg2: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_srl_epi64(arg1: __m256i, arg2: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_srli_epi16(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_srli_epi32(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_srli_epi64(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_srlv_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_srlv_epi64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm_srlv_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_srlv_epi64(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_blend_epi32(arg1: __m128i, arg2: __m128i, arg3: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm256_blend_epi32(arg1: __m256i, arg2: __m256i, arg3: ::std::os::raw::c_int)
        -> __m256i;
}
extern "C" {
    pub fn _mm256_alignr_epi8(arg1: __m256i, arg2: __m256i, arg3: ::std::os::raw::c_int)
        -> __m256i;
}
extern "C" {
    pub fn _mm256_blendv_epi8(arg1: __m256i, arg2: __m256i, arg3: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_blend_epi16(arg1: __m256i, arg2: __m256i, arg3: ::std::os::raw::c_int)
        -> __m256i;
}
extern "C" {
    pub fn _mm256_packs_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_packs_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_packus_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_packus_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_unpackhi_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_unpackhi_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_unpackhi_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_unpackhi_epi64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_unpacklo_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_unpacklo_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_unpacklo_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_unpacklo_epi64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_shuffle_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_shuffle_epi32(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_shufflehi_epi16(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_shufflelo_epi16(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_extracti128_si256(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m128i;
}
extern "C" {
    pub fn _mm256_inserti128_si256(
        arg1: __m256i,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm_broadcastss_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_broadcastsd_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm_broadcastb_epi8(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_broadcastw_epi16(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_broadcastd_epi32(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_broadcastq_epi64(arg1: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm256_broadcastss_ps(arg1: __m128) -> __m256;
}
extern "C" {
    pub fn _mm256_broadcastsd_pd(arg1: __m128d) -> __m256d;
}
extern "C" {
    pub fn _mm256_broadcastb_epi8(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_broadcastw_epi16(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_broadcastd_epi32(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_broadcastq_epi64(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_broadcastsi128_si256(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepi8_epi16(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepi8_epi32(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepi8_epi64(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepi16_epi32(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepi16_epi64(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepi32_epi64(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepu8_epi16(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepu8_epi32(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepu8_epi64(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepu16_epi32(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepu16_epi64(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_cvtepu32_epi64(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _mm256_movemask_epi8(arg1: __m256i) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_maskload_epi32(arg1: *const ::std::os::raw::c_int, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_maskload_epi64(arg1: *const ::std::os::raw::c_longlong, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_maskstore_epi32(arg1: *mut ::std::os::raw::c_int, arg2: __m128i, arg3: __m128i);
}
extern "C" {
    pub fn _mm_maskstore_epi64(arg1: *mut ::std::os::raw::c_longlong, arg2: __m128i, arg3: __m128i);
}
extern "C" {
    pub fn _mm256_maskload_epi32(arg1: *const ::std::os::raw::c_int, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_maskload_epi64(arg1: *const ::std::os::raw::c_longlong, arg2: __m256i)
        -> __m256i;
}
extern "C" {
    pub fn _mm256_maskstore_epi32(arg1: *mut ::std::os::raw::c_int, arg2: __m256i, arg3: __m256i);
}
extern "C" {
    pub fn _mm256_maskstore_epi64(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: __m256i,
        arg3: __m256i,
    );
}
extern "C" {
    pub fn _mm256_permutevar8x32_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_permutevar8x32_ps(arg1: __m256, arg2: __m256i) -> __m256;
}
extern "C" {
    pub fn _mm256_permute4x64_epi64(arg1: __m256i, arg2: ::std::os::raw::c_int) -> __m256i;
}
extern "C" {
    pub fn _mm256_permute4x64_pd(arg1: __m256d, arg2: ::std::os::raw::c_int) -> __m256d;
}
extern "C" {
    pub fn _mm256_permute2x128_si256(
        arg1: __m256i,
        arg2: __m256i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_stream_load_si256(arg1: *const __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_mask_i32gather_pd(
        arg1: __m256d,
        arg2: *const f64,
        arg3: __m128i,
        arg4: __m256d,
        arg5: ::std::os::raw::c_int,
    ) -> __m256d;
}
extern "C" {
    pub fn _mm256_mask_i32gather_ps(
        arg1: __m256,
        arg2: *const f32,
        arg3: __m256i,
        arg4: __m256,
        arg5: ::std::os::raw::c_int,
    ) -> __m256;
}
extern "C" {
    pub fn _mm256_mask_i64gather_pd(
        arg1: __m256d,
        arg2: *const f64,
        arg3: __m256i,
        arg4: __m256d,
        arg5: ::std::os::raw::c_int,
    ) -> __m256d;
}
extern "C" {
    pub fn _mm256_mask_i64gather_ps(
        arg1: __m128,
        arg2: *const f32,
        arg3: __m256i,
        arg4: __m128,
        arg5: ::std::os::raw::c_int,
    ) -> __m128;
}
extern "C" {
    pub fn _mm_mask_i32gather_pd(
        arg1: __m128d,
        arg2: *const f64,
        arg3: __m128i,
        arg4: __m128d,
        arg5: ::std::os::raw::c_int,
    ) -> __m128d;
}
extern "C" {
    pub fn _mm_mask_i32gather_ps(
        arg1: __m128,
        arg2: *const f32,
        arg3: __m128i,
        arg4: __m128,
        arg5: ::std::os::raw::c_int,
    ) -> __m128;
}
extern "C" {
    pub fn _mm_mask_i64gather_pd(
        arg1: __m128d,
        arg2: *const f64,
        arg3: __m128i,
        arg4: __m128d,
        arg5: ::std::os::raw::c_int,
    ) -> __m128d;
}
extern "C" {
    pub fn _mm_mask_i64gather_ps(
        arg1: __m128,
        arg2: *const f32,
        arg3: __m128i,
        arg4: __m128,
        arg5: ::std::os::raw::c_int,
    ) -> __m128;
}
extern "C" {
    pub fn _mm256_mask_i32gather_epi32(
        arg1: __m256i,
        arg2: *const ::std::os::raw::c_int,
        arg3: __m256i,
        arg4: __m256i,
        arg5: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_mask_i32gather_epi64(
        arg1: __m256i,
        arg2: *const ::std::os::raw::c_longlong,
        arg3: __m128i,
        arg4: __m256i,
        arg5: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_mask_i64gather_epi32(
        arg1: __m128i,
        arg2: *const ::std::os::raw::c_int,
        arg3: __m256i,
        arg4: __m128i,
        arg5: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm256_mask_i64gather_epi64(
        arg1: __m256i,
        arg2: *const ::std::os::raw::c_longlong,
        arg3: __m256i,
        arg4: __m256i,
        arg5: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm_mask_i32gather_epi32(
        arg1: __m128i,
        arg2: *const ::std::os::raw::c_int,
        arg3: __m128i,
        arg4: __m128i,
        arg5: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_mask_i32gather_epi64(
        arg1: __m128i,
        arg2: *const ::std::os::raw::c_longlong,
        arg3: __m128i,
        arg4: __m128i,
        arg5: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_mask_i64gather_epi32(
        arg1: __m128i,
        arg2: *const ::std::os::raw::c_int,
        arg3: __m128i,
        arg4: __m128i,
        arg5: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_mask_i64gather_epi64(
        arg1: __m128i,
        arg2: *const ::std::os::raw::c_longlong,
        arg3: __m128i,
        arg4: __m128i,
        arg5: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm256_i32gather_pd(
        arg1: *const f64,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256d;
}
extern "C" {
    pub fn _mm256_i32gather_ps(
        arg1: *const f32,
        arg2: __m256i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256;
}
extern "C" {
    pub fn _mm256_i64gather_pd(
        arg1: *const f64,
        arg2: __m256i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256d;
}
extern "C" {
    pub fn _mm256_i64gather_ps(
        arg1: *const f32,
        arg2: __m256i,
        arg3: ::std::os::raw::c_int,
    ) -> __m128;
}
extern "C" {
    pub fn _mm_i32gather_pd(
        arg1: *const f64,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m128d;
}
extern "C" {
    pub fn _mm_i32gather_ps(arg1: *const f32, arg2: __m128i, arg3: ::std::os::raw::c_int)
        -> __m128;
}
extern "C" {
    pub fn _mm_i64gather_pd(
        arg1: *const f64,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m128d;
}
extern "C" {
    pub fn _mm_i64gather_ps(arg1: *const f32, arg2: __m128i, arg3: ::std::os::raw::c_int)
        -> __m128;
}
extern "C" {
    pub fn _mm256_i32gather_epi32(
        arg1: *const ::std::os::raw::c_int,
        arg2: __m256i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_i32gather_epi64(
        arg1: *const ::std::os::raw::c_longlong,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_i64gather_epi32(
        arg1: *const ::std::os::raw::c_int,
        arg2: __m256i,
        arg3: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm256_i64gather_epi64(
        arg1: *const ::std::os::raw::c_longlong,
        arg2: __m256i,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm_i32gather_epi32(
        arg1: *const ::std::os::raw::c_int,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_i32gather_epi64(
        arg1: *const ::std::os::raw::c_longlong,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_i64gather_epi32(
        arg1: *const ::std::os::raw::c_int,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_i64gather_epi64(
        arg1: *const ::std::os::raw::c_longlong,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _bextr_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _bextr2_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _blsi_u32(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _blsmsk_u32(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _blsr_u32(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _bzhi_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _mulx_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
        arg3: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _pdep_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _pext_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _rorx_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _sarx_i32(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _shlx_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _shrx_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _bextr_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_uint,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _bextr2_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _blsi_u64(arg1: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _blsmsk_u64(arg1: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _blsr_u64(arg1: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _bzhi_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _mulx_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_ulonglong,
        arg3: *mut ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _pdep_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _pext_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _rorx_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _sarx_i64(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _shlx_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _shrx_u64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _lzcnt_u32(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _lzcnt_u64(arg1: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _tzcnt_u16(arg1: ::std::os::raw::c_ushort) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn _tzcnt_u32(arg1: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _tzcnt_u64(arg1: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _invpcid(arg1: ::std::os::raw::c_uint, arg2: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _Store_HLERelease(arg1: *mut ::std::os::raw::c_long, arg2: ::std::os::raw::c_long);
}
extern "C" {
    pub fn _StorePointer_HLERelease(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn _InterlockedExchange_HLEAcquire(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedExchange_HLERelease(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedExchangePointer_HLEAcquire(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _InterlockedExchangePointer_HLERelease(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _InterlockedCompareExchange_HLEAcquire(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedCompareExchange_HLERelease(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
        arg3: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedCompareExchange64_HLEAcquire(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedCompareExchange64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedCompareExchangePointer_HLEAcquire(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _InterlockedCompareExchangePointer_HLERelease(
        arg1: *mut *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _InterlockedExchangeAdd_HLEAcquire(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedExchangeAdd_HLERelease(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedAnd_HLEAcquire(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedAnd_HLERelease(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedOr_HLEAcquire(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedOr_HLERelease(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedXor_HLEAcquire(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _InterlockedXor_HLERelease(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _interlockedbittestandset_HLEAcquire(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _interlockedbittestandset_HLERelease(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _interlockedbittestandreset_HLEAcquire(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _interlockedbittestandreset_HLERelease(
        arg1: *mut ::std::os::raw::c_long,
        arg2: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _Store64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    );
}
extern "C" {
    pub fn _InterlockedExchange64_HLEAcquire(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedExchange64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedExchangeAdd64_HLEAcquire(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedExchangeAdd64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedAnd64_HLEAcquire(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedAnd64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedOr64_HLEAcquire(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedOr64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedXor64_HLEAcquire(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _InterlockedXor64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _interlockedbittestandset64_HLEAcquire(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _interlockedbittestandset64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _interlockedbittestandreset64_HLEAcquire(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _interlockedbittestandreset64_HLERelease(
        arg1: *mut ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _xbegin() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _xend();
}
extern "C" {
    pub fn _xabort(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _xtest() -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _rdseed16_step(arg1: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _rdseed32_step(arg1: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _rdseed64_step(arg1: *mut ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _addcarryx_u32(
        arg1: ::std::os::raw::c_uchar,
        arg2: ::std::os::raw::c_uint,
        arg3: ::std::os::raw::c_uint,
        arg4: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _addcarryx_u64(
        arg1: ::std::os::raw::c_uchar,
        arg2: ::std::os::raw::c_ulonglong,
        arg3: ::std::os::raw::c_ulonglong,
        arg4: *mut ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _load_be_u16(arg1: *const ::std::os::raw::c_void) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn _load_be_u32(arg1: *const ::std::os::raw::c_void) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _load_be_u64(arg1: *const ::std::os::raw::c_void) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _store_be_u16(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ushort);
}
extern "C" {
    pub fn _store_be_u32(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _store_be_u64(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _mm_sha1msg1_epu32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sha1msg2_epu32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sha1nexte_epu32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sha1rnds4_epu32(
        arg1: __m128i,
        arg2: __m128i,
        arg3: ::std::os::raw::c_int,
    ) -> __m128i;
}
extern "C" {
    pub fn _mm_sha256msg1_epu32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sha256msg2_epu32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_sha256rnds2_epu32(arg1: __m128i, arg2: __m128i, arg3: __m128i) -> __m128i;
}
extern "C" {
    pub fn _bnd_set_ptr_bounds(
        arg1: *const ::std::os::raw::c_void,
        arg2: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _bnd_narrow_ptr_bounds(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _bnd_copy_ptr_bounds(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _bnd_init_ptr_bounds(arg1: *const ::std::os::raw::c_void)
        -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _bnd_store_ptr_bounds(
        arg1: *mut *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn _bnd_chk_ptr_lbounds(arg1: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn _bnd_chk_ptr_ubounds(arg1: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn _bnd_chk_ptr_bounds(arg1: *const ::std::os::raw::c_void, arg2: usize);
}
extern "C" {
    pub fn _bnd_load_ptr_bounds(
        arg1: *mut *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _bnd_get_ptr_lbound(
        arg1: *const ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_void;
}
extern "C" {
    pub fn _bnd_get_ptr_ubound(
        arg1: *const ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_void;
}
extern "C" {
    pub fn _mm256_insert_epi8(
        arg1: __m256i,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_insert_epi16(
        arg1: __m256i,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_insert_epi32(
        arg1: __m256i,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_insert_epi64(
        arg1: __m256i,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_int,
    ) -> __m256i;
}
extern "C" {
    pub fn _mm256_extract_epi8(arg1: __m256i, arg2: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_extract_epi16(
        arg1: __m256i,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_extract_epi32(
        arg1: __m256i,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm256_extract_epi64(
        arg1: __m256i,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _mm256_zextpd128_pd256(arg1: __m128d) -> __m256d;
}
extern "C" {
    pub fn _mm256_zextps128_ps256(arg1: __m128) -> __m256;
}
extern "C" {
    pub fn _mm256_zextsi128_si256(arg1: __m128i) -> __m256i;
}
extern "C" {
    pub fn _rdpid_u32() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _ptwrite32(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _ptwrite64(arg1: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _mm_dpbusd_avx_epi32(arg1: __m128i, arg2: __m128i, arg3: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm256_dpbusd_avx_epi32(arg1: __m256i, arg2: __m256i, arg3: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm_dpbusds_avx_epi32(arg1: __m128i, arg2: __m128i, arg3: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm256_dpbusds_avx_epi32(arg1: __m256i, arg2: __m256i, arg3: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm_dpwssd_avx_epi32(arg1: __m128i, arg2: __m128i, arg3: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm256_dpwssd_avx_epi32(arg1: __m256i, arg2: __m256i, arg3: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm_dpwssds_avx_epi32(arg1: __m128i, arg2: __m128i, arg3: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm256_dpwssds_avx_epi32(arg1: __m256i, arg2: __m256i, arg3: __m256i) -> __m256i;
}
extern "C" {
    pub fn _pconfig_u32(arg1: ::std::os::raw::c_int, __data: *mut usize) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _wbnoinvd();
}
extern "C" {
    pub fn _encls_u32(arg1: ::std::os::raw::c_int, __data: *mut usize) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _enclu_u32(arg1: ::std::os::raw::c_int, __data: *mut usize) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _enclv_u32(arg1: ::std::os::raw::c_int, __data: *mut usize) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _div128(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_longlong,
        arg4: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _udiv64(
        arg1: ::std::os::raw::c_ulonglong,
        arg2: ::std::os::raw::c_uint,
        arg3: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _div64(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mm_aesdec128kl_u8(
        arg1: *mut __m128i,
        arg2: __m128i,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _mm_aesdec256kl_u8(
        arg1: *mut __m128i,
        arg2: __m128i,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _mm_aesdecwide128kl_u8(
        arg1: *mut __m128i,
        arg2: *const __m128i,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _mm_aesdecwide256kl_u8(
        arg1: *mut __m128i,
        arg2: *const __m128i,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _mm_aesenc128kl_u8(
        arg1: *mut __m128i,
        arg2: __m128i,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _mm_aesenc256kl_u8(
        arg1: *mut __m128i,
        arg2: __m128i,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _mm_aesencwide128kl_u8(
        arg1: *mut __m128i,
        arg2: *const __m128i,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _mm_aesencwide256kl_u8(
        arg1: *mut __m128i,
        arg2: *const __m128i,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _mm_encodekey128_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: __m128i,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _mm_encodekey256_u32(
        arg1: ::std::os::raw::c_uint,
        arg2: __m128i,
        arg3: __m128i,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _mm_loadiwkey(arg1: ::std::os::raw::c_uint, arg2: __m128i, arg3: __m128i, arg4: __m128i);
}
extern "C" {
    pub fn _rdpkru_u32() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _wrpkru(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _enqcmd(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _enqcmds(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _incsspd(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _rdsspd() -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _saveprevssp();
}
extern "C" {
    pub fn _rstorssp(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _wrssd(arg1: ::std::os::raw::c_uint, arg2: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _wrussd(arg1: ::std::os::raw::c_uint, arg2: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _setssbsy();
}
extern "C" {
    pub fn _clrssbsy(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _switchssp(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _incsspq(arg1: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _rdsspq() -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _wrssq(arg1: ::std::os::raw::c_ulonglong, arg2: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _wrussq(arg1: ::std::os::raw::c_ulonglong, arg2: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _mm_div_epi8(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_div_epi16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_div_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_div_epi64(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_div_epu8(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_div_epu16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_div_epu32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_div_epu64(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_rem_epi8(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_rem_epi16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_rem_epi32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_rem_epi64(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_rem_epu8(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_rem_epu16(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_rem_epu32(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_rem_epu64(arg1: __m128i, arg2: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm256_div_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_div_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_div_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_div_epi64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_div_epu8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_div_epu16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_div_epu32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_div_epu64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_rem_epi8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_rem_epi16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_rem_epi32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_rem_epi64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_rem_epu8(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_rem_epu16(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_rem_epu32(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_rem_epu64(arg1: __m256i, arg2: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm_divrem_epi32(arg1: *mut __m128i, arg2: __m128i, arg3: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm_divrem_epu32(arg1: *mut __m128i, arg2: __m128i, arg3: __m128i) -> __m128i;
}
extern "C" {
    pub fn _mm256_divrem_epi32(arg1: *mut __m256i, arg2: __m256i, arg3: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm256_divrem_epu32(arg1: *mut __m256i, arg2: __m256i, arg3: __m256i) -> __m256i;
}
extern "C" {
    pub fn _mm_sin_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_sin_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_sin_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_sin_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_cos_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cos_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_cos_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_cos_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_sincos_ps(arg1: *mut __m128, arg2: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_sincos_pd(arg1: *mut __m128d, arg2: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_sincos_ps(arg1: *mut __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_sincos_pd(arg1: *mut __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_tan_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_tan_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_tan_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_tan_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_asin_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_asin_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_asin_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_asin_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_acos_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_acos_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_acos_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_acos_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_atan_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_atan_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_atan_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_atan_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_atan2_ps(arg1: __m128, arg2: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_atan2_pd(arg1: __m128d, arg2: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_atan2_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_atan2_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_sind_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_sind_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_sind_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_sind_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_cosd_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cosd_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_cosd_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_cosd_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_tand_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_tand_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_tand_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_tand_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_sinh_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_sinh_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_sinh_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_sinh_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_cosh_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cosh_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_cosh_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_cosh_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_tanh_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_tanh_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_tanh_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_tanh_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_asinh_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_asinh_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_asinh_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_asinh_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_acosh_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_acosh_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_acosh_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_acosh_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_atanh_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_atanh_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_atanh_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_atanh_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_log_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_log_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_log_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_log_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_log1p_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_log1p_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_log1p_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_log1p_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_log10_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_log10_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_log10_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_log10_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_log2_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_log2_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_log2_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_log2_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_logb_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_logb_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_logb_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_logb_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_exp_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_exp_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_exp_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_exp_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_exp10_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_exp10_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_exp10_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_exp10_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_exp2_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_exp2_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_exp2_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_exp2_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_expm1_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_expm1_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_expm1_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_expm1_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_pow_ps(arg1: __m128, arg2: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_pow_pd(arg1: __m128d, arg2: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_pow_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_pow_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_trunc_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_trunc_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_trunc_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_trunc_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_svml_floor_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_svml_floor_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_svml_floor_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_svml_floor_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_svml_ceil_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_svml_ceil_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_svml_ceil_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_svml_ceil_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_svml_round_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_svml_round_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_svml_round_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_svml_round_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_fmod_ps(arg1: __m128, arg2: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_fmod_pd(arg1: __m128d, arg2: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_fmod_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_fmod_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_svml_sqrt_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_svml_sqrt_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_svml_sqrt_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_svml_sqrt_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_invsqrt_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_invsqrt_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_invsqrt_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_invsqrt_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_cbrt_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cbrt_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_cbrt_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_cbrt_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_invcbrt_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_invcbrt_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_invcbrt_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_invcbrt_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_hypot_ps(arg1: __m128, arg2: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_hypot_pd(arg1: __m128d, arg2: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_hypot_ps(arg1: __m256, arg2: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_hypot_pd(arg1: __m256d, arg2: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_cdfnorm_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cdfnorm_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_cdfnorm_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_cdfnorm_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_cdfnorminv_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_cdfnorminv_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_cdfnorminv_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_cdfnorminv_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_cexp_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm256_cexp_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm_clog_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm256_clog_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm_csqrt_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm256_csqrt_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm_erf_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_erf_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_erf_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_erf_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_erfc_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_erfc_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_erfc_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_erfc_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_erfcinv_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_erfcinv_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_erfcinv_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_erfcinv_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_erfinv_ps(arg1: __m128) -> __m128;
}
extern "C" {
    pub fn _mm_erfinv_pd(arg1: __m128d) -> __m128d;
}
extern "C" {
    pub fn _mm256_erfinv_ps(arg1: __m256) -> __m256;
}
extern "C" {
    pub fn _mm256_erfinv_pd(arg1: __m256d) -> __m256d;
}
extern "C" {
    pub fn _mm_cldemote(arg1: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn _directstoreu_u32(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _directstoreu_u64(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _movdir64b(arg1: *mut ::std::os::raw::c_void, arg2: *const ::std::os::raw::c_void);
}
extern "C" {
    pub fn _serialize();
}
extern "C" {
    pub fn _xsusldtrk();
}
extern "C" {
    pub fn _xresldtrk();
}
extern "C" {
    pub fn _umonitor(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _umwait(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _tpause(
        arg1: ::std::os::raw::c_uint,
        arg2: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _clui();
}
extern "C" {
    pub fn _stui();
}
extern "C" {
    pub fn _testui() -> ::std::os::raw::c_uchar;
}
extern "C" {
    pub fn _senduipi(arg1: ::std::os::raw::c_ulonglong);
}
extern "C" {
    pub fn _hreset(arg1: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _mm_svml_cvtepu32_ps(arg1: __m128i) -> __m128;
}
extern "C" {
    pub fn _mm256_svml_cvtepu32_ps(arg1: __m256i) -> __m256;
}
extern "C" {
    pub fn _mm_svml_cvtepu32_pd(arg1: __m128i) -> __m128d;
}
extern "C" {
    pub fn _mm256_svml_cvtepu32_pd(arg1: __m128i) -> __m256d;
}
extern "C" {
    pub fn _mm_svml_cvtepi64_pd(arg1: __m128i) -> __m128d;
}
extern "C" {
    pub fn _mm256_svml_cvtepi64_pd(arg1: __m256i) -> __m256d;
}
extern "C" {
    pub fn _mm_svml_cvtepu64_pd(arg1: __m128i) -> __m128d;
}
extern "C" {
    pub fn _mm256_svml_cvtepu64_pd(arg1: __m256i) -> __m256d;
}
extern "C" {
    pub fn _castf32_u32(arg1: f32) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _castf64_u64(arg1: f64) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _castu32_f32(arg1: ::std::os::raw::c_uint) -> f32;
}
extern "C" {
    pub fn _castu64_f64(arg1: ::std::os::raw::c_ulonglong) -> f64;
}
pub type __mmask8 = ::std::os::raw::c_uchar;
pub type __mmask16 = ::std::os::raw::c_ushort;
pub type __mmask32 = ::std::os::raw::c_uint;
pub type __mmask64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub union __m512 {
    pub m512_f32: [f32; 16usize],
}
#[test]
fn bindgen_test_layout___m512() {
    const UNINIT: ::std::mem::MaybeUninit<__m512> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__m512>(),
        64usize,
        concat!("Size of: ", stringify!(__m512))
    );
    assert_eq!(
        ::std::mem::align_of::<__m512>(),
        64usize,
        concat!("Alignment of ", stringify!(__m512))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m512_f32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m512),
            "::",
            stringify!(m512_f32)
        )
    );
}
#[repr(C)]
#[repr(align(64))]
#[derive(Debug, Copy, Clone)]
pub struct __m512d {
    pub m512d_f64: [f64; 8usize],
}
#[test]
fn bindgen_test_layout___m512d() {
    const UNINIT: ::std::mem::MaybeUninit<__m512d> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__m512d>(),
        64usize,
        concat!("Size of: ", stringify!(__m512d))
    );
    assert_eq!(
        ::std::mem::align_of::<__m512d>(),
        64usize,
        concat!("Alignment of ", stringify!(__m512d))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m512d_f64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m512d),
            "::",
            stringify!(m512d_f64)
        )
    );
}
#[repr(C)]
#[repr(align(64))]
#[derive(Copy, Clone)]
pub union __m512i {
    pub m512i_i8: [::std::os::raw::c_char; 64usize],
    pub m512i_i16: [::std::os::raw::c_short; 32usize],
    pub m512i_i32: [::std::os::raw::c_int; 16usize],
    pub m512i_i64: [::std::os::raw::c_longlong; 8usize],
    pub m512i_u8: [::std::os::raw::c_uchar; 64usize],
    pub m512i_u16: [::std::os::raw::c_ushort; 32usize],
    pub m512i_u32: [::std::os::raw::c_uint; 16usize],
    pub m512i_u64: [::std::os::raw::c_ulonglong; 8usize],
}
#[test]
fn bindgen_test_layout___m512i() {
    const UNINIT: ::std::mem::MaybeUninit<__m512i> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__m512i>(),
        64usize,
        concat!("Size of: ", stringify!(__m512i))
    );
    assert_eq!(
        ::std::mem::align_of::<__m512i>(),
        64usize,
        concat!("Alignment of ", stringify!(__m512i))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m512i_i8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m512i),
            "::",
            stringify!(m512i_i8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m512i_i16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m512i),
            "::",
            stringify!(m512i_i16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m512i_i32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m512i),
            "::",
            stringify!(m512i_i32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m512i_i64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m512i),
            "::",
            stringify!(m512i_i64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m512i_u8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m512i),
            "::",
            stringify!(m512i_u8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m512i_u16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m512i),
            "::",
            stringify!(m512i_u16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m512i_u32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m512i),
            "::",
            stringify!(m512i_u32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m512i_u64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__m512i),
            "::",
            stringify!(m512i_u64)
        )
    );
}
extern "C" {
    pub fn _mm512_castps512_ps256(arg1: __m512) -> __m256;
}
extern "C" {
    pub fn _mm512_castpd_ps(arg1: __m512d) -> __m512;
}
extern "C" {
    pub fn _mm512_castps256_ps512(arg1: __m256) -> __m512;
}
extern "C" {
    pub fn _mm512_castsi512_ps(arg1: __m512i) -> __m512;
}
extern "C" {
    pub fn _mm512_castps128_ps512(arg1: __m128) -> __m512;
}
extern "C" {
    pub fn _mm512_castpd512_pd256(arg1: __m512d) -> __m256d;
}
extern "C" {
    pub fn _mm512_castpd256_pd512(arg1: __m256d) -> __m512d;
}
extern "C" {
    pub fn _mm512_castps_pd(arg1: __m512) -> __m512d;
}
extern "C" {
    pub fn _mm512_castsi512_pd(arg1: __m512i) -> __m512d;
}
extern "C" {
    pub fn _mm512_castpd128_pd512(arg1: __m128d) -> __m512d;
}
extern "C" {
    pub fn _mm512_castsi512_si256(arg1: __m512i) -> __m256i;
}
extern "C" {
    pub fn _mm512_castpd_si512(arg1: __m512d) -> __m512i;
}
extern "C" {
    pub fn _mm512_castps_si512(arg1: __m512) -> __m512i;
}
extern "C" {
    pub fn _mm512_castsi256_si512(arg1: __m256i) -> __m512i;
}
pub const _MM_BROADCAST32_ENUM__MM_BROADCAST32_NONE: _MM_BROADCAST32_ENUM = 0;
pub const _MM_BROADCAST32_ENUM__MM_BROADCAST_1X16: _MM_BROADCAST32_ENUM = 1;
pub const _MM_BROADCAST32_ENUM__MM_BROADCAST_4X16: _MM_BROADCAST32_ENUM = 2;
pub type _MM_BROADCAST32_ENUM = ::std::os::raw::c_int;
pub const _MM_BROADCAST64_ENUM__MM_BROADCAST64_NONE: _MM_BROADCAST64_ENUM = 0;
pub const _MM_BROADCAST64_ENUM__MM_BROADCAST_1X8: _MM_BROADCAST64_ENUM = 1;
pub const _MM_BROADCAST64_ENUM__MM_BROADCAST_4X8: _MM_BROADCAST64_ENUM = 2;
pub type _MM_BROADCAST64_ENUM = ::std::os::raw::c_int;
pub const _MM_ROUND_MODE_ENUM__MM_ROUND_MODE_NEAREST: _MM_ROUND_MODE_ENUM = 0;
pub const _MM_ROUND_MODE_ENUM__MM_ROUND_MODE_DOWN: _MM_ROUND_MODE_ENUM = 1;
pub const _MM_ROUND_MODE_ENUM__MM_ROUND_MODE_UP: _MM_ROUND_MODE_ENUM = 2;
pub const _MM_ROUND_MODE_ENUM__MM_ROUND_MODE_TOWARD_ZERO: _MM_ROUND_MODE_ENUM = 3;
pub const _MM_ROUND_MODE_ENUM__MM_ROUND_MODE_DEFAULT: _MM_ROUND_MODE_ENUM = 4;
pub const _MM_ROUND_MODE_ENUM__MM_ROUND_MODE_NO_EXC: _MM_ROUND_MODE_ENUM = 8;
pub type _MM_ROUND_MODE_ENUM = ::std::os::raw::c_int;
pub const _MM_EXP_ADJ_ENUM__MM_EXPADJ_NONE: _MM_EXP_ADJ_ENUM = 0;
pub const _MM_EXP_ADJ_ENUM__MM_EXPADJ_4: _MM_EXP_ADJ_ENUM = 1;
pub const _MM_EXP_ADJ_ENUM__MM_EXPADJ_5: _MM_EXP_ADJ_ENUM = 2;
pub const _MM_EXP_ADJ_ENUM__MM_EXPADJ_8: _MM_EXP_ADJ_ENUM = 3;
pub const _MM_EXP_ADJ_ENUM__MM_EXPADJ_16: _MM_EXP_ADJ_ENUM = 4;
pub const _MM_EXP_ADJ_ENUM__MM_EXPADJ_24: _MM_EXP_ADJ_ENUM = 5;
pub const _MM_EXP_ADJ_ENUM__MM_EXPADJ_31: _MM_EXP_ADJ_ENUM = 6;
pub const _MM_EXP_ADJ_ENUM__MM_EXPADJ_32: _MM_EXP_ADJ_ENUM = 7;
pub type _MM_EXP_ADJ_ENUM = ::std::os::raw::c_int;
pub const _MM_INDEX_SCALE_ENUM__MM_SCALE_1: _MM_INDEX_SCALE_ENUM = 1;
pub const _MM_INDEX_SCALE_ENUM__MM_SCALE_2: _MM_INDEX_SCALE_ENUM = 2;
pub const _MM_INDEX_SCALE_ENUM__MM_SCALE_4: _MM_INDEX_SCALE_ENUM = 4;
pub const _MM_INDEX_SCALE_ENUM__MM_SCALE_8: _MM_INDEX_SCALE_ENUM = 8;
pub type _MM_INDEX_SCALE_ENUM = ::std::os::raw::c_int;
pub const _MM_PERM_ENUM__MM_PERM_AAAA: _MM_PERM_ENUM = 0;
pub const _MM_PERM_ENUM__MM_PERM_AAAB: _MM_PERM_ENUM = 1;
pub const _MM_PERM_ENUM__MM_PERM_AAAC: _MM_PERM_ENUM = 2;
pub const _MM_PERM_ENUM__MM_PERM_AAAD: _MM_PERM_ENUM = 3;
pub const _MM_PERM_ENUM__MM_PERM_AABA: _MM_PERM_ENUM = 4;
pub const _MM_PERM_ENUM__MM_PERM_AABB: _MM_PERM_ENUM = 5;
pub const _MM_PERM_ENUM__MM_PERM_AABC: _MM_PERM_ENUM = 6;
pub const _MM_PERM_ENUM__MM_PERM_AABD: _MM_PERM_ENUM = 7;
pub const _MM_PERM_ENUM__MM_PERM_AACA: _MM_PERM_ENUM = 8;
pub const _MM_PERM_ENUM__MM_PERM_AACB: _MM_PERM_ENUM = 9;
pub const _MM_PERM_ENUM__MM_PERM_AACC: _MM_PERM_ENUM = 10;
pub const _MM_PERM_ENUM__MM_PERM_AACD: _MM_PERM_ENUM = 11;
pub const _MM_PERM_ENUM__MM_PERM_AADA: _MM_PERM_ENUM = 12;
pub const _MM_PERM_ENUM__MM_PERM_AADB: _MM_PERM_ENUM = 13;
pub const _MM_PERM_ENUM__MM_PERM_AADC: _MM_PERM_ENUM = 14;
pub const _MM_PERM_ENUM__MM_PERM_AADD: _MM_PERM_ENUM = 15;
pub const _MM_PERM_ENUM__MM_PERM_ABAA: _MM_PERM_ENUM = 16;
pub const _MM_PERM_ENUM__MM_PERM_ABAB: _MM_PERM_ENUM = 17;
pub const _MM_PERM_ENUM__MM_PERM_ABAC: _MM_PERM_ENUM = 18;
pub const _MM_PERM_ENUM__MM_PERM_ABAD: _MM_PERM_ENUM = 19;
pub const _MM_PERM_ENUM__MM_PERM_ABBA: _MM_PERM_ENUM = 20;
pub const _MM_PERM_ENUM__MM_PERM_ABBB: _MM_PERM_ENUM = 21;
pub const _MM_PERM_ENUM__MM_PERM_ABBC: _MM_PERM_ENUM = 22;
pub const _MM_PERM_ENUM__MM_PERM_ABBD: _MM_PERM_ENUM = 23;
pub const _MM_PERM_ENUM__MM_PERM_ABCA: _MM_PERM_ENUM = 24;
pub const _MM_PERM_ENUM__MM_PERM_ABCB: _MM_PERM_ENUM = 25;
pub const _MM_PERM_ENUM__MM_PERM_ABCC: _MM_PERM_ENUM = 26;
pub const _MM_PERM_ENUM__MM_PERM_ABCD: _MM_PERM_ENUM = 27;
pub const _MM_PERM_ENUM__MM_PERM_ABDA: _MM_PERM_ENUM = 28;
pub const _MM_PERM_ENUM__MM_PERM_ABDB: _MM_PERM_ENUM = 29;
pub const _MM_PERM_ENUM__MM_PERM_ABDC: _MM_PERM_ENUM = 30;
pub const _MM_PERM_ENUM__MM_PERM_ABDD: _MM_PERM_ENUM = 31;
pub const _MM_PERM_ENUM__MM_PERM_ACAA: _MM_PERM_ENUM = 32;
pub const _MM_PERM_ENUM__MM_PERM_ACAB: _MM_PERM_ENUM = 33;
pub const _MM_PERM_ENUM__MM_PERM_ACAC: _MM_PERM_ENUM = 34;
pub const _MM_PERM_ENUM__MM_PERM_ACAD: _MM_PERM_ENUM = 35;
pub const _MM_PERM_ENUM__MM_PERM_ACBA: _MM_PERM_ENUM = 36;
pub const _MM_PERM_ENUM__MM_PERM_ACBB: _MM_PERM_ENUM = 37;
pub const _MM_PERM_ENUM__MM_PERM_ACBC: _MM_PERM_ENUM = 38;
pub const _MM_PERM_ENUM__MM_PERM_ACBD: _MM_PERM_ENUM = 39;
pub const _MM_PERM_ENUM__MM_PERM_ACCA: _MM_PERM_ENUM = 40;
pub const _MM_PERM_ENUM__MM_PERM_ACCB: _MM_PERM_ENUM = 41;
pub const _MM_PERM_ENUM__MM_PERM_ACCC: _MM_PERM_ENUM = 42;
pub const _MM_PERM_ENUM__MM_PERM_ACCD: _MM_PERM_ENUM = 43;
pub const _MM_PERM_ENUM__MM_PERM_ACDA: _MM_PERM_ENUM = 44;
pub const _MM_PERM_ENUM__MM_PERM_ACDB: _MM_PERM_ENUM = 45;
pub const _MM_PERM_ENUM__MM_PERM_ACDC: _MM_PERM_ENUM = 46;
pub const _MM_PERM_ENUM__MM_PERM_ACDD: _MM_PERM_ENUM = 47;
pub const _MM_PERM_ENUM__MM_PERM_ADAA: _MM_PERM_ENUM = 48;
pub const _MM_PERM_ENUM__MM_PERM_ADAB: _MM_PERM_ENUM = 49;
pub const _MM_PERM_ENUM__MM_PERM_ADAC: _MM_PERM_ENUM = 50;
pub const _MM_PERM_ENUM__MM_PERM_ADAD: _MM_PERM_ENUM = 51;
pub const _MM_PERM_ENUM__MM_PERM_ADBA: _MM_PERM_ENUM = 52;
pub const _MM_PERM_ENUM__MM_PERM_ADBB: _MM_PERM_ENUM = 53;
pub const _MM_PERM_ENUM__MM_PERM_ADBC: _MM_PERM_ENUM = 54;
pub const _MM_PERM_ENUM__MM_PERM_ADBD: _MM_PERM_ENUM = 55;
pub const _MM_PERM_ENUM__MM_PERM_ADCA: _MM_PERM_ENUM = 56;
pub const _MM_PERM_ENUM__MM_PERM_ADCB: _MM_PERM_ENUM = 57;
pub const _MM_PERM_ENUM__MM_PERM_ADCC: _MM_PERM_ENUM = 58;
pub const _MM_PERM_ENUM__MM_PERM_ADCD: _MM_PERM_ENUM = 59;
pub const _MM_PERM_ENUM__MM_PERM_ADDA: _MM_PERM_ENUM = 60;
pub const _MM_PERM_ENUM__MM_PERM_ADDB: _MM_PERM_ENUM = 61;
pub const _MM_PERM_ENUM__MM_PERM_ADDC: _MM_PERM_ENUM = 62;
pub const _MM_PERM_ENUM__MM_PERM_ADDD: _MM_PERM_ENUM = 63;
pub const _MM_PERM_ENUM__MM_PERM_BAAA: _MM_PERM_ENUM = 64;
pub const _MM_PERM_ENUM__MM_PERM_BAAB: _MM_PERM_ENUM = 65;
pub const _MM_PERM_ENUM__MM_PERM_BAAC: _MM_PERM_ENUM = 66;
pub const _MM_PERM_ENUM__MM_PERM_BAAD: _MM_PERM_ENUM = 67;
pub const _MM_PERM_ENUM__MM_PERM_BABA: _MM_PERM_ENUM = 68;
pub const _MM_PERM_ENUM__MM_PERM_BABB: _MM_PERM_ENUM = 69;
pub const _MM_PERM_ENUM__MM_PERM_BABC: _MM_PERM_ENUM = 70;
pub const _MM_PERM_ENUM__MM_PERM_BABD: _MM_PERM_ENUM = 71;
pub const _MM_PERM_ENUM__MM_PERM_BACA: _MM_PERM_ENUM = 72;
pub const _MM_PERM_ENUM__MM_PERM_BACB: _MM_PERM_ENUM = 73;
pub const _MM_PERM_ENUM__MM_PERM_BACC: _MM_PERM_ENUM = 74;
pub const _MM_PERM_ENUM__MM_PERM_BACD: _MM_PERM_ENUM = 75;
pub const _MM_PERM_ENUM__MM_PERM_BADA: _MM_PERM_ENUM = 76;
pub const _MM_PERM_ENUM__MM_PERM_BADB: _MM_PERM_ENUM = 77;
pub const _MM_PERM_ENUM__MM_PERM_BADC: _MM_PERM_ENUM = 78;
pub const _MM_PERM_ENUM__MM_PERM_BADD: _MM_PERM_ENUM = 79;
pub const _MM_PERM_ENUM__MM_PERM_BBAA: _MM_PERM_ENUM = 80;
pub const _MM_PERM_ENUM__MM_PERM_BBAB: _MM_PERM_ENUM = 81;
pub const _MM_PERM_ENUM__MM_PERM_BBAC: _MM_PERM_ENUM = 82;
pub const _MM_PERM_ENUM__MM_PERM_BBAD: _MM_PERM_ENUM = 83;
pub const _MM_PERM_ENUM__MM_PERM_BBBA: _MM_PERM_ENUM = 84;
pub const _MM_PERM_ENUM__MM_PERM_BBBB: _MM_PERM_ENUM = 85;
pub const _MM_PERM_ENUM__MM_PERM_BBBC: _MM_PERM_ENUM = 86;
pub const _MM_PERM_ENUM__MM_PERM_BBBD: _MM_PERM_ENUM = 87;
pub const _MM_PERM_ENUM__MM_PERM_BBCA: _MM_PERM_ENUM = 88;
pub const _MM_PERM_ENUM__MM_PERM_BBCB: _MM_PERM_ENUM = 89;
pub const _MM_PERM_ENUM__MM_PERM_BBCC: _MM_PERM_ENUM = 90;
pub const _MM_PERM_ENUM__MM_PERM_BBCD: _MM_PERM_ENUM = 91;
pub const _MM_PERM_ENUM__MM_PERM_BBDA: _MM_PERM_ENUM = 92;
pub const _MM_PERM_ENUM__MM_PERM_BBDB: _MM_PERM_ENUM = 93;
pub const _MM_PERM_ENUM__MM_PERM_BBDC: _MM_PERM_ENUM = 94;
pub const _MM_PERM_ENUM__MM_PERM_BBDD: _MM_PERM_ENUM = 95;
pub const _MM_PERM_ENUM__MM_PERM_BCAA: _MM_PERM_ENUM = 96;
pub const _MM_PERM_ENUM__MM_PERM_BCAB: _MM_PERM_ENUM = 97;
pub const _MM_PERM_ENUM__MM_PERM_BCAC: _MM_PERM_ENUM = 98;
pub const _MM_PERM_ENUM__MM_PERM_BCAD: _MM_PERM_ENUM = 99;
pub const _MM_PERM_ENUM__MM_PERM_BCBA: _MM_PERM_ENUM = 100;
pub const _MM_PERM_ENUM__MM_PERM_BCBB: _MM_PERM_ENUM = 101;
pub const _MM_PERM_ENUM__MM_PERM_BCBC: _MM_PERM_ENUM = 102;
pub const _MM_PERM_ENUM__MM_PERM_BCBD: _MM_PERM_ENUM = 103;
pub const _MM_PERM_ENUM__MM_PERM_BCCA: _MM_PERM_ENUM = 104;
pub const _MM_PERM_ENUM__MM_PERM_BCCB: _MM_PERM_ENUM = 105;
pub const _MM_PERM_ENUM__MM_PERM_BCCC: _MM_PERM_ENUM = 106;
pub const _MM_PERM_ENUM__MM_PERM_BCCD: _MM_PERM_ENUM = 107;
pub const _MM_PERM_ENUM__MM_PERM_BCDA: _MM_PERM_ENUM = 108;
pub const _MM_PERM_ENUM__MM_PERM_BCDB: _MM_PERM_ENUM = 109;
pub const _MM_PERM_ENUM__MM_PERM_BCDC: _MM_PERM_ENUM = 110;
pub const _MM_PERM_ENUM__MM_PERM_BCDD: _MM_PERM_ENUM = 111;
pub const _MM_PERM_ENUM__MM_PERM_BDAA: _MM_PERM_ENUM = 112;
pub const _MM_PERM_ENUM__MM_PERM_BDAB: _MM_PERM_ENUM = 113;
pub const _MM_PERM_ENUM__MM_PERM_BDAC: _MM_PERM_ENUM = 114;
pub const _MM_PERM_ENUM__MM_PERM_BDAD: _MM_PERM_ENUM = 115;
pub const _MM_PERM_ENUM__MM_PERM_BDBA: _MM_PERM_ENUM = 116;
pub const _MM_PERM_ENUM__MM_PERM_BDBB: _MM_PERM_ENUM = 117;
pub const _MM_PERM_ENUM__MM_PERM_BDBC: _MM_PERM_ENUM = 118;
pub const _MM_PERM_ENUM__MM_PERM_BDBD: _MM_PERM_ENUM = 119;
pub const _MM_PERM_ENUM__MM_PERM_BDCA: _MM_PERM_ENUM = 120;
pub const _MM_PERM_ENUM__MM_PERM_BDCB: _MM_PERM_ENUM = 121;
pub const _MM_PERM_ENUM__MM_PERM_BDCC: _MM_PERM_ENUM = 122;
pub const _MM_PERM_ENUM__MM_PERM_BDCD: _MM_PERM_ENUM = 123;
pub const _MM_PERM_ENUM__MM_PERM_BDDA: _MM_PERM_ENUM = 124;
pub const _MM_PERM_ENUM__MM_PERM_BDDB: _MM_PERM_ENUM = 125;
pub const _MM_PERM_ENUM__MM_PERM_BDDC: _MM_PERM_ENUM = 126;
pub const _MM_PERM_ENUM__MM_PERM_BDDD: _MM_PERM_ENUM = 127;
pub const _MM_PERM_ENUM__MM_PERM_CAAA: _MM_PERM_ENUM = 128;
pub const _MM_PERM_ENUM__MM_PERM_CAAB: _MM_PERM_ENUM = 129;
pub const _MM_PERM_ENUM__MM_PERM_CAAC: _MM_PERM_ENUM = 130;
pub const _MM_PERM_ENUM__MM_PERM_CAAD: _MM_PERM_ENUM = 131;
pub const _MM_PERM_ENUM__MM_PERM_CABA: _MM_PERM_ENUM = 132;
pub const _MM_PERM_ENUM__MM_PERM_CABB: _MM_PERM_ENUM = 133;
pub const _MM_PERM_ENUM__MM_PERM_CABC: _MM_PERM_ENUM = 134;
pub const _MM_PERM_ENUM__MM_PERM_CABD: _MM_PERM_ENUM = 135;
pub const _MM_PERM_ENUM__MM_PERM_CACA: _MM_PERM_ENUM = 136;
pub const _MM_PERM_ENUM__MM_PERM_CACB: _MM_PERM_ENUM = 137;
pub const _MM_PERM_ENUM__MM_PERM_CACC: _MM_PERM_ENUM = 138;
pub const _MM_PERM_ENUM__MM_PERM_CACD: _MM_PERM_ENUM = 139;
pub const _MM_PERM_ENUM__MM_PERM_CADA: _MM_PERM_ENUM = 140;
pub const _MM_PERM_ENUM__MM_PERM_CADB: _MM_PERM_ENUM = 141;
pub const _MM_PERM_ENUM__MM_PERM_CADC: _MM_PERM_ENUM = 142;
pub const _MM_PERM_ENUM__MM_PERM_CADD: _MM_PERM_ENUM = 143;
pub const _MM_PERM_ENUM__MM_PERM_CBAA: _MM_PERM_ENUM = 144;
pub const _MM_PERM_ENUM__MM_PERM_CBAB: _MM_PERM_ENUM = 145;
pub const _MM_PERM_ENUM__MM_PERM_CBAC: _MM_PERM_ENUM = 146;
pub const _MM_PERM_ENUM__MM_PERM_CBAD: _MM_PERM_ENUM = 147;
pub const _MM_PERM_ENUM__MM_PERM_CBBA: _MM_PERM_ENUM = 148;
pub const _MM_PERM_ENUM__MM_PERM_CBBB: _MM_PERM_ENUM = 149;
pub const _MM_PERM_ENUM__MM_PERM_CBBC: _MM_PERM_ENUM = 150;
pub const _MM_PERM_ENUM__MM_PERM_CBBD: _MM_PERM_ENUM = 151;
pub const _MM_PERM_ENUM__MM_PERM_CBCA: _MM_PERM_ENUM = 152;
pub const _MM_PERM_ENUM__MM_PERM_CBCB: _MM_PERM_ENUM = 153;
pub const _MM_PERM_ENUM__MM_PERM_CBCC: _MM_PERM_ENUM = 154;
pub const _MM_PERM_ENUM__MM_PERM_CBCD: _MM_PERM_ENUM = 155;
pub const _MM_PERM_ENUM__MM_PERM_CBDA: _MM_PERM_ENUM = 156;
pub const _MM_PERM_ENUM__MM_PERM_CBDB: _MM_PERM_ENUM = 157;
pub const _MM_PERM_ENUM__MM_PERM_CBDC: _MM_PERM_ENUM = 158;
pub const _MM_PERM_ENUM__MM_PERM_CBDD: _MM_PERM_ENUM = 159;
pub const _MM_PERM_ENUM__MM_PERM_CCAA: _MM_PERM_ENUM = 160;
pub const _MM_PERM_ENUM__MM_PERM_CCAB: _MM_PERM_ENUM = 161;
pub const _MM_PERM_ENUM__MM_PERM_CCAC: _MM_PERM_ENUM = 162;
pub const _MM_PERM_ENUM__MM_PERM_CCAD: _MM_PERM_ENUM = 163;
pub const _MM_PERM_ENUM__MM_PERM_CCBA: _MM_PERM_ENUM = 164;
pub const _MM_PERM_ENUM__MM_PERM_CCBB: _MM_PERM_ENUM = 165;
pub const _MM_PERM_ENUM__MM_PERM_CCBC: _MM_PERM_ENUM = 166;
pub const _MM_PERM_ENUM__MM_PERM_CCBD: _MM_PERM_ENUM = 167;
pub const _MM_PERM_ENUM__MM_PERM_CCCA: _MM_PERM_ENUM = 168;
pub const _MM_PERM_ENUM__MM_PERM_CCCB: _MM_PERM_ENUM = 169;
pub const _MM_PERM_ENUM__MM_PERM_CCCC: _MM_PERM_ENUM = 170;
pub const _MM_PERM_ENUM__MM_PERM_CCCD: _MM_PERM_ENUM = 171;
pub const _MM_PERM_ENUM__MM_PERM_CCDA: _MM_PERM_ENUM = 172;
pub const _MM_PERM_ENUM__MM_PERM_CCDB: _MM_PERM_ENUM = 173;
pub const _MM_PERM_ENUM__MM_PERM_CCDC: _MM_PERM_ENUM = 174;
pub const _MM_PERM_ENUM__MM_PERM_CCDD: _MM_PERM_ENUM = 175;
pub const _MM_PERM_ENUM__MM_PERM_CDAA: _MM_PERM_ENUM = 176;
pub const _MM_PERM_ENUM__MM_PERM_CDAB: _MM_PERM_ENUM = 177;
pub const _MM_PERM_ENUM__MM_PERM_CDAC: _MM_PERM_ENUM = 178;
pub const _MM_PERM_ENUM__MM_PERM_CDAD: _MM_PERM_ENUM = 179;
pub const _MM_PERM_ENUM__MM_PERM_CDBA: _MM_PERM_ENUM = 180;
pub const _MM_PERM_ENUM__MM_PERM_CDBB: _MM_PERM_ENUM = 181;
pub const _MM_PERM_ENUM__MM_PERM_CDBC: _MM_PERM_ENUM = 182;
pub const _MM_PERM_ENUM__MM_PERM_CDBD: _MM_PERM_ENUM = 183;
pub const _MM_PERM_ENUM__MM_PERM_CDCA: _MM_PERM_ENUM = 184;
pub const _MM_PERM_ENUM__MM_PERM_CDCB: _MM_PERM_ENUM = 185;
pub const _MM_PERM_ENUM__MM_PERM_CDCC: _MM_PERM_ENUM = 186;
pub const _MM_PERM_ENUM__MM_PERM_CDCD: _MM_PERM_ENUM = 187;
pub const _MM_PERM_ENUM__MM_PERM_CDDA: _MM_PERM_ENUM = 188;
pub const _MM_PERM_ENUM__MM_PERM_CDDB: _MM_PERM_ENUM = 189;
pub const _MM_PERM_ENUM__MM_PERM_CDDC: _MM_PERM_ENUM = 190;
pub const _MM_PERM_ENUM__MM_PERM_CDDD: _MM_PERM_ENUM = 191;
pub const _MM_PERM_ENUM__MM_PERM_DAAA: _MM_PERM_ENUM = 192;
pub const _MM_PERM_ENUM__MM_PERM_DAAB: _MM_PERM_ENUM = 193;
pub const _MM_PERM_ENUM__MM_PERM_DAAC: _MM_PERM_ENUM = 194;
pub const _MM_PERM_ENUM__MM_PERM_DAAD: _MM_PERM_ENUM = 195;
pub const _MM_PERM_ENUM__MM_PERM_DABA: _MM_PERM_ENUM = 196;
pub const _MM_PERM_ENUM__MM_PERM_DABB: _MM_PERM_ENUM = 197;
pub const _MM_PERM_ENUM__MM_PERM_DABC: _MM_PERM_ENUM = 198;
pub const _MM_PERM_ENUM__MM_PERM_DABD: _MM_PERM_ENUM = 199;
pub const _MM_PERM_ENUM__MM_PERM_DACA: _MM_PERM_ENUM = 200;
pub const _MM_PERM_ENUM__MM_PERM_DACB: _MM_PERM_ENUM = 201;
pub const _MM_PERM_ENUM__MM_PERM_DACC: _MM_PERM_ENUM = 202;
pub const _MM_PERM_ENUM__MM_PERM_DACD: _MM_PERM_ENUM = 203;
pub const _MM_PERM_ENUM__MM_PERM_DADA: _MM_PERM_ENUM = 204;
pub const _MM_PERM_ENUM__MM_PERM_DADB: _MM_PERM_ENUM = 205;
pub const _MM_PERM_ENUM__MM_PERM_DADC: _MM_PERM_ENUM = 206;
pub const _MM_PERM_ENUM__MM_PERM_DADD: _MM_PERM_ENUM = 207;
pub const _MM_PERM_ENUM__MM_PERM_DBAA: _MM_PERM_ENUM = 208;
pub const _MM_PERM_ENUM__MM_PERM_DBAB: _MM_PERM_ENUM = 209;
pub const _MM_PERM_ENUM__MM_PERM_DBAC: _MM_PERM_ENUM = 210;
pub const _MM_PERM_ENUM__MM_PERM_DBAD: _MM_PERM_ENUM = 211;
pub const _MM_PERM_ENUM__MM_PERM_DBBA: _MM_PERM_ENUM = 212;
pub const _MM_PERM_ENUM__MM_PERM_DBBB: _MM_PERM_ENUM = 213;
pub const _MM_PERM_ENUM__MM_PERM_DBBC: _MM_PERM_ENUM = 214;
pub const _MM_PERM_ENUM__MM_PERM_DBBD: _MM_PERM_ENUM = 215;
pub const _MM_PERM_ENUM__MM_PERM_DBCA: _MM_PERM_ENUM = 216;
pub const _MM_PERM_ENUM__MM_PERM_DBCB: _MM_PERM_ENUM = 217;
pub const _MM_PERM_ENUM__MM_PERM_DBCC: _MM_PERM_ENUM = 218;
pub const _MM_PERM_ENUM__MM_PERM_DBCD: _MM_PERM_ENUM = 219;
pub const _MM_PERM_ENUM__MM_PERM_DBDA: _MM_PERM_ENUM = 220;
pub const _MM_PERM_ENUM__MM_PERM_DBDB: _MM_PERM_ENUM = 221;
pub const _MM_PERM_ENUM__MM_PERM_DBDC: _MM_PERM_ENUM = 222;
pub const _MM_PERM_ENUM__MM_PERM_DBDD: _MM_PERM_ENUM = 223;
pub const _MM_PERM_ENUM__MM_PERM_DCAA: _MM_PERM_ENUM = 224;
pub const _MM_PERM_ENUM__MM_PERM_DCAB: _MM_PERM_ENUM = 225;
pub const _MM_PERM_ENUM__MM_PERM_DCAC: _MM_PERM_ENUM = 226;
pub const _MM_PERM_ENUM__MM_PERM_DCAD: _MM_PERM_ENUM = 227;
pub const _MM_PERM_ENUM__MM_PERM_DCBA: _MM_PERM_ENUM = 228;
pub const _MM_PERM_ENUM__MM_PERM_DCBB: _MM_PERM_ENUM = 229;
pub const _MM_PERM_ENUM__MM_PERM_DCBC: _MM_PERM_ENUM = 230;
pub const _MM_PERM_ENUM__MM_PERM_DCBD: _MM_PERM_ENUM = 231;
pub const _MM_PERM_ENUM__MM_PERM_DCCA: _MM_PERM_ENUM = 232;
pub const _MM_PERM_ENUM__MM_PERM_DCCB: _MM_PERM_ENUM = 233;
pub const _MM_PERM_ENUM__MM_PERM_DCCC: _MM_PERM_ENUM = 234;
pub const _MM_PERM_ENUM__MM_PERM_DCCD: _MM_PERM_ENUM = 235;
pub const _MM_PERM_ENUM__MM_PERM_DCDA: _MM_PERM_ENUM = 236;
pub const _MM_PERM_ENUM__MM_PERM_DCDB: _MM_PERM_ENUM = 237;
pub const _MM_PERM_ENUM__MM_PERM_DCDC: _MM_PERM_ENUM = 238;
pub const _MM_PERM_ENUM__MM_PERM_DCDD: _MM_PERM_ENUM = 239;
pub const _MM_PERM_ENUM__MM_PERM_DDAA: _MM_PERM_ENUM = 240;
pub const _MM_PERM_ENUM__MM_PERM_DDAB: _MM_PERM_ENUM = 241;
pub const _MM_PERM_ENUM__MM_PERM_DDAC: _MM_PERM_ENUM = 242;
pub const _MM_PERM_ENUM__MM_PERM_DDAD: _MM_PERM_ENUM = 243;
pub const _MM_PERM_ENUM__MM_PERM_DDBA: _MM_PERM_ENUM = 244;
pub const _MM_PERM_ENUM__MM_PERM_DDBB: _MM_PERM_ENUM = 245;
pub const _MM_PERM_ENUM__MM_PERM_DDBC: _MM_PERM_ENUM = 246;
pub const _MM_PERM_ENUM__MM_PERM_DDBD: _MM_PERM_ENUM = 247;
pub const _MM_PERM_ENUM__MM_PERM_DDCA: _MM_PERM_ENUM = 248;
pub const _MM_PERM_ENUM__MM_PERM_DDCB: _MM_PERM_ENUM = 249;
pub const _MM_PERM_ENUM__MM_PERM_DDCC: _MM_PERM_ENUM = 250;
pub const _MM_PERM_ENUM__MM_PERM_DDCD: _MM_PERM_ENUM = 251;
pub const _MM_PERM_ENUM__MM_PERM_DDDA: _MM_PERM_ENUM = 252;
pub const _MM_PERM_ENUM__MM_PERM_DDDB: _MM_PERM_ENUM = 253;
pub const _MM_PERM_ENUM__MM_PERM_DDDC: _MM_PERM_ENUM = 254;
pub const _MM_PERM_ENUM__MM_PERM_DDDD: _MM_PERM_ENUM = 255;
pub type _MM_PERM_ENUM = ::std::os::raw::c_int;
pub const _MM_FIXUPRESULT_ENUM__MM_FIXUP_NO_CHANGE: _MM_FIXUPRESULT_ENUM = 0;
pub const _MM_FIXUPRESULT_ENUM__MM_FIXUP_NEG_INF: _MM_FIXUPRESULT_ENUM = 1;
pub const _MM_FIXUPRESULT_ENUM__MM_FIXUP_NEG_ZERO: _MM_FIXUPRESULT_ENUM = 2;
pub const _MM_FIXUPRESULT_ENUM__MM_FIXUP_POS_ZERO: _MM_FIXUPRESULT_ENUM = 3;
pub const _MM_FIXUPRESULT_ENUM__MM_FIXUP_POS_INF: _MM_FIXUPRESULT_ENUM = 4;
pub const _MM_FIXUPRESULT_ENUM__MM_FIXUP_NAN: _MM_FIXUPRESULT_ENUM = 5;
pub const _MM_FIXUPRESULT_ENUM__MM_FIXUP_MAX_FLOAT: _MM_FIXUPRESULT_ENUM = 6;
pub const _MM_FIXUPRESULT_ENUM__MM_FIXUP_MIN_FLOAT: _MM_FIXUPRESULT_ENUM = 7;
pub type _MM_FIXUPRESULT_ENUM = ::std::os::raw::c_int;
pub const _MM_MANTISSA_NORM_ENUM__MM_MANT_NORM_1_2: _MM_MANTISSA_NORM_ENUM = 0;
pub const _MM_MANTISSA_NORM_ENUM__MM_MANT_NORM_p5_2: _MM_MANTISSA_NORM_ENUM = 1;
pub const _MM_MANTISSA_NORM_ENUM__MM_MANT_NORM_p5_1: _MM_MANTISSA_NORM_ENUM = 2;
pub const _MM_MANTISSA_NORM_ENUM__MM_MANT_NORM_p75_1p5: _MM_MANTISSA_NORM_ENUM = 3;
pub type _MM_MANTISSA_NORM_ENUM = ::std::os::raw::c_int;
pub const _MM_MANTISSA_SIGN_ENUM__MM_MANT_SIGN_src: _MM_MANTISSA_SIGN_ENUM = 0;
pub const _MM_MANTISSA_SIGN_ENUM__MM_MANT_SIGN_zero: _MM_MANTISSA_SIGN_ENUM = 1;
pub const _MM_MANTISSA_SIGN_ENUM__MM_MANT_SIGN_nan: _MM_MANTISSA_SIGN_ENUM = 2;
pub type _MM_MANTISSA_SIGN_ENUM = ::std::os::raw::c_int;
pub const _MM_CMPINT_ENUM__MM_CMPINT_EQ: _MM_CMPINT_ENUM = 0;
pub const _MM_CMPINT_ENUM__MM_CMPINT_LT: _MM_CMPINT_ENUM = 1;
pub const _MM_CMPINT_ENUM__MM_CMPINT_LE: _MM_CMPINT_ENUM = 2;
pub const _MM_CMPINT_ENUM__MM_CMPINT_UNUSED: _MM_CMPINT_ENUM = 3;
pub const _MM_CMPINT_ENUM__MM_CMPINT_NE: _MM_CMPINT_ENUM = 4;
pub const _MM_CMPINT_ENUM__MM_CMPINT_NLT: _MM_CMPINT_ENUM = 5;
pub const _MM_CMPINT_ENUM__MM_CMPINT_NLE: _MM_CMPINT_ENUM = 6;
pub type _MM_CMPINT_ENUM = ::std::os::raw::c_int;
extern "C" {
    pub fn _mm512_setzero_ps() -> __m512;
}
extern "C" {
    pub fn _mm512_setzero_pd() -> __m512d;
}
extern "C" {
    pub fn _mm512_set_ps(
        arg1: f32,
        arg2: f32,
        arg3: f32,
        arg4: f32,
        arg5: f32,
        arg6: f32,
        arg7: f32,
        arg8: f32,
        arg9: f32,
        arg10: f32,
        arg11: f32,
        arg12: f32,
        arg13: f32,
        arg14: f32,
        arg15: f32,
        arg16: f32,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_set_pd(
        arg1: f64,
        arg2: f64,
        arg3: f64,
        arg4: f64,
        arg5: f64,
        arg6: f64,
        arg7: f64,
        arg8: f64,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_setr_ps(
        arg1: f32,
        arg2: f32,
        arg3: f32,
        arg4: f32,
        arg5: f32,
        arg6: f32,
        arg7: f32,
        arg8: f32,
        arg9: f32,
        arg10: f32,
        arg11: f32,
        arg12: f32,
        arg13: f32,
        arg14: f32,
        arg15: f32,
        arg16: f32,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_setr_pd(
        arg1: f64,
        arg2: f64,
        arg3: f64,
        arg4: f64,
        arg5: f64,
        arg6: f64,
        arg7: f64,
        arg8: f64,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_set1_ps(arg1: f32) -> __m512;
}
extern "C" {
    pub fn _mm512_set1_pd(arg1: f64) -> __m512d;
}
extern "C" {
    pub fn _mm512_load_ps(arg1: *const ::std::os::raw::c_void) -> __m512;
}
extern "C" {
    pub fn _mm512_load_pd(arg1: *const ::std::os::raw::c_void) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_load_ps(arg1: __mmask16, arg2: *const ::std::os::raw::c_void) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_load_pd(arg1: __mmask8, arg2: *const ::std::os::raw::c_void) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_load_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: *const ::std::os::raw::c_void,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_load_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: *const ::std::os::raw::c_void,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_loadu_ps(arg1: *const ::std::os::raw::c_void) -> __m512;
}
extern "C" {
    pub fn _mm512_loadu_pd(arg1: *const ::std::os::raw::c_void) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_loadu_ps(arg1: __mmask16, arg2: *const ::std::os::raw::c_void) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_loadu_pd(arg1: __mmask8, arg2: *const ::std::os::raw::c_void) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_loadu_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: *const ::std::os::raw::c_void,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_loadu_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: *const ::std::os::raw::c_void,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_store_ps(arg1: *mut ::std::os::raw::c_void, arg2: __m512);
}
extern "C" {
    pub fn _mm512_store_pd(arg1: *mut ::std::os::raw::c_void, arg2: __m512d);
}
extern "C" {
    pub fn _mm512_storeu_ps(arg1: *mut ::std::os::raw::c_void, arg2: __m512);
}
extern "C" {
    pub fn _mm512_storeu_pd(arg1: *mut ::std::os::raw::c_void, arg2: __m512d);
}
extern "C" {
    pub fn _mm512_mask_store_ps(arg1: *mut ::std::os::raw::c_void, arg2: __mmask16, arg3: __m512);
}
extern "C" {
    pub fn _mm512_mask_store_pd(arg1: *mut ::std::os::raw::c_void, arg2: __mmask8, arg3: __m512d);
}
extern "C" {
    pub fn _mm512_mask_storeu_ps(arg1: *mut ::std::os::raw::c_void, arg2: __mmask16, arg3: __m512);
}
extern "C" {
    pub fn _mm512_mask_storeu_pd(arg1: *mut ::std::os::raw::c_void, arg2: __mmask8, arg3: __m512d);
}
extern "C" {
    pub fn _mm512_add_ps(arg1: __m512, arg2: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_add_ps(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_add_ps(arg1: __m512, arg2: __mmask16, arg3: __m512, arg4: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_add_round_ps(arg1: __m512, arg2: __m512, arg3: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_add_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_add_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_add_pd(arg1: __m512d, arg2: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_add_pd(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_add_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_add_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_add_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_add_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_sub_ps(arg1: __m512, arg2: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_sub_ps(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_sub_ps(arg1: __m512, arg2: __mmask16, arg3: __m512, arg4: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_sub_round_ps(arg1: __m512, arg2: __m512, arg3: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_sub_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_sub_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_sub_pd(arg1: __m512d, arg2: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_sub_pd(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_sub_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_sub_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_sub_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_sub_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mul_ps(arg1: __m512, arg2: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_mul_ps(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_mul_ps(arg1: __m512, arg2: __mmask16, arg3: __m512, arg4: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mul_round_ps(arg1: __m512, arg2: __m512, arg3: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_mul_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_mul_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mul_pd(arg1: __m512d, arg2: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_mul_pd(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_mul_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mul_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_mul_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_mul_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_div_ps(arg1: __m512, arg2: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_div_ps(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_div_ps(arg1: __m512, arg2: __mmask16, arg3: __m512, arg4: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_div_round_ps(arg1: __m512, arg2: __m512, arg3: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_div_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_div_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_div_pd(arg1: __m512d, arg2: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_div_pd(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_div_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_div_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_div_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_div_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fmadd_ps(arg1: __m512, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fmadd_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fmadd_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fmadd_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fmadd_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fmadd_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fmadd_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fmadd_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fmadd_pd(arg1: __m512d, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fmadd_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fmadd_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fmadd_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fmadd_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fmadd_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fmadd_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fmadd_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fmsub_ps(arg1: __m512, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fmsub_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fmsub_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fmsub_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fmsub_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fmsub_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fmsub_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fmsub_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fmsub_pd(arg1: __m512d, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fmsub_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fmsub_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fmsub_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fmsub_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fmsub_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fmsub_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fmsub_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fmaddsub_ps(arg1: __m512, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fmaddsub_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fmaddsub_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fmaddsub_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fmaddsub_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fmaddsub_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fmaddsub_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fmaddsub_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fmaddsub_pd(arg1: __m512d, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fmaddsub_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fmaddsub_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fmaddsub_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fmaddsub_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fmaddsub_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fmaddsub_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fmaddsub_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fmsubadd_ps(arg1: __m512, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fmsubadd_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fmsubadd_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fmsubadd_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fmsubadd_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fmsubadd_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fmsubadd_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fmsubadd_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fmsubadd_pd(arg1: __m512d, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fmsubadd_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fmsubadd_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fmsubadd_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fmsubadd_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fmsubadd_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fmsubadd_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fmsubadd_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fnmadd_ps(arg1: __m512, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fnmadd_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fnmadd_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fnmadd_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fnmadd_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fnmadd_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fnmadd_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fnmadd_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fnmadd_pd(arg1: __m512d, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fnmadd_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fnmadd_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fnmadd_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fnmadd_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fnmadd_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fnmadd_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fnmadd_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fnmsub_ps(arg1: __m512, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fnmsub_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fnmsub_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fnmsub_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fnmsub_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_fnmsub_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask3_fnmsub_round_ps(
        arg1: __m512,
        arg2: __m512,
        arg3: __m512,
        arg4: __mmask16,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_fnmsub_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_fnmsub_pd(arg1: __m512d, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fnmsub_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fnmsub_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fnmsub_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_fnmsub_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_fnmsub_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask3_fnmsub_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __mmask8,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_fnmsub_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_sqrt_ps(arg1: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_sqrt_pd(arg1: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_sqrt_ps(arg1: __mmask16, arg2: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_sqrt_pd(arg1: __mmask8, arg2: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_sqrt_ps(arg1: __m512, arg2: __mmask16, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_sqrt_pd(arg1: __m512d, arg2: __mmask8, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_sqrt_round_ps(arg1: __m512, arg2: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_sqrt_round_pd(arg1: __m512d, arg2: ::std::os::raw::c_int) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_sqrt_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_sqrt_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_sqrt_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_sqrt_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_abs_ps(arg1: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_abs_ps(arg1: __mmask16, arg2: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_abs_ps(arg1: __m512, arg2: __mmask16, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_abs_pd(arg1: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_abs_pd(arg1: __mmask8, arg2: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_abs_pd(arg1: __m512d, arg2: __mmask8, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_max_ps(arg1: __m512, arg2: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_max_pd(arg1: __m512d, arg2: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_max_ps(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_max_pd(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_max_ps(arg1: __m512, arg2: __mmask16, arg3: __m512, arg4: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_max_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_max_round_ps(arg1: __m512, arg2: __m512, arg3: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_max_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_max_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_max_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_max_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_max_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_min_ps(arg1: __m512, arg2: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_min_pd(arg1: __m512d, arg2: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_min_ps(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_min_pd(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_min_ps(arg1: __m512, arg2: __mmask16, arg3: __m512, arg4: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_min_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_min_round_ps(arg1: __m512, arg2: __m512, arg3: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_min_round_pd(
        arg1: __m512d,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_min_round_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_min_round_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_min_round_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_min_round_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_rcp14_ps(arg1: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_rcp14_pd(arg1: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_rcp14_ps(arg1: __mmask16, arg2: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_rcp14_pd(arg1: __mmask8, arg2: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_rcp14_ps(arg1: __m512, arg2: __mmask16, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_rcp14_pd(arg1: __m512d, arg2: __mmask8, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_rsqrt14_ps(arg1: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_rsqrt14_pd(arg1: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_rsqrt14_ps(arg1: __mmask16, arg2: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_rsqrt14_pd(arg1: __mmask8, arg2: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_rsqrt14_ps(arg1: __m512, arg2: __mmask16, arg3: __m512) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_rsqrt14_pd(arg1: __m512d, arg2: __mmask8, arg3: __m512d) -> __m512d;
}
extern "C" {
    pub fn _mm512_cvtps_pd(arg1: __m256) -> __m512d;
}
extern "C" {
    pub fn _mm512_cvtpd_ps(arg1: __m512d) -> __m256;
}
extern "C" {
    pub fn _mm512_maskz_cvtps_pd(arg1: __mmask8, arg2: __m256) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_cvtpd_ps(arg1: __mmask8, arg2: __m512d) -> __m256;
}
extern "C" {
    pub fn _mm512_mask_cvtps_pd(arg1: __m512d, arg2: __mmask8, arg3: __m256) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_cvtpd_ps(arg1: __m256, arg2: __mmask8, arg3: __m512d) -> __m256;
}
extern "C" {
    pub fn _mm512_cvt_roundps_pd(arg1: __m256, arg2: ::std::os::raw::c_int) -> __m512d;
}
extern "C" {
    pub fn _mm512_cvt_roundpd_ps(arg1: __m512d, arg2: ::std::os::raw::c_int) -> __m256;
}
extern "C" {
    pub fn _mm512_maskz_cvt_roundps_pd(
        arg1: __mmask8,
        arg2: __m256,
        arg3: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_cvt_roundpd_ps(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m256;
}
extern "C" {
    pub fn _mm512_mask_cvt_roundps_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m256,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_cvt_roundpd_ps(
        arg1: __m256,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m256;
}
extern "C" {
    pub fn _mm512_cmp_ps_mask(arg1: __m512, arg2: __m512, arg3: ::std::os::raw::c_int)
        -> __mmask16;
}
extern "C" {
    pub fn _mm512_mask_cmp_ps_mask(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __mmask16;
}
extern "C" {
    pub fn _mm512_cmp_round_ps_mask(
        arg1: __m512,
        arg2: __m512,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> __mmask16;
}
extern "C" {
    pub fn _mm512_mask_cmp_round_ps_mask(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> __mmask16;
}
extern "C" {
    pub fn _mm512_cmp_pd_mask(
        arg1: __m512d,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __mmask8;
}
extern "C" {
    pub fn _mm512_mask_cmp_pd_mask(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __mmask8;
}
extern "C" {
    pub fn _mm512_cmp_round_pd_mask(
        arg1: __m512d,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> __mmask8;
}
extern "C" {
    pub fn _mm512_mask_cmp_round_pd_mask(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> __mmask8;
}
extern "C" {
    pub fn _mm512_broadcast_f32x2(arg1: __m128) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_broadcast_f32x2(arg1: __m512, arg2: __mmask16, arg3: __m128) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_broadcast_f32x2(arg1: __mmask16, arg2: __m128) -> __m512;
}
extern "C" {
    pub fn _mm512_broadcast_f32x4(arg1: __m128) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_broadcast_f32x4(arg1: __m512, arg2: __mmask16, arg3: __m128) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_broadcast_f32x4(arg1: __mmask16, arg2: __m128) -> __m512;
}
extern "C" {
    pub fn _mm512_broadcast_f32x8(arg1: __m256) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_broadcast_f32x8(arg1: __m512, arg2: __mmask16, arg3: __m256) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_broadcast_f32x8(arg1: __mmask16, arg2: __m256) -> __m512;
}
extern "C" {
    pub fn _mm512_broadcast_f64x2(arg1: __m128d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_broadcast_f64x2(arg1: __m512d, arg2: __mmask8, arg3: __m128d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_broadcast_f64x2(arg1: __mmask8, arg2: __m128d) -> __m512d;
}
extern "C" {
    pub fn _mm512_broadcast_f64x4(arg1: __m256d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_broadcast_f64x4(arg1: __m512d, arg2: __mmask8, arg3: __m256d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_broadcast_f64x4(arg1: __mmask8, arg2: __m256d) -> __m512d;
}
extern "C" {
    pub fn _mm512_broadcastsd_pd(arg1: __m128d) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_broadcastsd_pd(arg1: __m512d, arg2: __mmask8, arg3: __m128d) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_broadcastsd_pd(arg1: __mmask8, arg2: __m128d) -> __m512d;
}
extern "C" {
    pub fn _mm512_broadcastss_ps(arg1: __m128) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_broadcastss_ps(arg1: __m512, arg2: __mmask16, arg3: __m128) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_broadcastss_ps(arg1: __mmask16, arg2: __m128) -> __m512;
}
extern "C" {
    pub fn _mm512_extractf32x4_ps(arg1: __m512, arg2: ::std::os::raw::c_int) -> __m128;
}
extern "C" {
    pub fn _mm512_mask_extractf32x4_ps(
        arg1: __m128,
        arg2: __mmask8,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m128;
}
extern "C" {
    pub fn _mm512_maskz_extractf32x4_ps(
        arg1: __mmask8,
        arg2: __m512,
        arg3: ::std::os::raw::c_int,
    ) -> __m128;
}
extern "C" {
    pub fn _mm512_extractf32x8_ps(arg1: __m512, arg2: ::std::os::raw::c_int) -> __m256;
}
extern "C" {
    pub fn _mm512_mask_extractf32x8_ps(
        arg1: __m256,
        arg2: __mmask8,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m256;
}
extern "C" {
    pub fn _mm512_maskz_extractf32x8_ps(
        arg1: __mmask8,
        arg2: __m512,
        arg3: ::std::os::raw::c_int,
    ) -> __m256;
}
extern "C" {
    pub fn _mm512_extractf64x2_pd(arg1: __m512d, arg2: ::std::os::raw::c_int) -> __m128d;
}
extern "C" {
    pub fn _mm512_mask_extractf64x2_pd(
        arg1: __m128d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m128d;
}
extern "C" {
    pub fn _mm512_maskz_extractf64x2_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m128d;
}
extern "C" {
    pub fn _mm512_extractf64x4_pd(arg1: __m512d, arg2: ::std::os::raw::c_int) -> __m256d;
}
extern "C" {
    pub fn _mm512_mask_extractf64x4_pd(
        arg1: __m256d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m256d;
}
extern "C" {
    pub fn _mm512_maskz_extractf64x4_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m256d;
}
extern "C" {
    pub fn _mm512_insertf32x4(arg1: __m512, arg2: __m128, arg3: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_insertf32x4(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m128,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_insertf32x4(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m128,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_insertf32x8(arg1: __m512, arg2: __m256, arg3: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_insertf32x8(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m256,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_insertf32x8(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m256,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_insertf64x2(arg1: __m512d, arg2: __m128d, arg3: ::std::os::raw::c_int)
        -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_insertf64x2(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m128d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_insertf64x2(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m128d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_insertf64x4(arg1: __m512d, arg2: __m256d, arg3: ::std::os::raw::c_int)
        -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_insertf64x4(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m256d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_insertf64x4(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m256d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_shuffle_f32x4(arg1: __m512, arg2: __m512, arg3: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_shuffle_f32x4(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_shuffle_f32x4(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_shuffle_f64x2(
        arg1: __m512d,
        arg2: __m512d,
        arg3: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_shuffle_f64x2(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_shuffle_f64x2(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_shuffle_pd(arg1: __m512d, arg2: __m512d, arg3: ::std::os::raw::c_int) -> __m512d;
}
extern "C" {
    pub fn _mm512_mask_shuffle_pd(
        arg1: __m512d,
        arg2: __mmask8,
        arg3: __m512d,
        arg4: __m512d,
        arg5: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_maskz_shuffle_pd(
        arg1: __mmask8,
        arg2: __m512d,
        arg3: __m512d,
        arg4: ::std::os::raw::c_int,
    ) -> __m512d;
}
extern "C" {
    pub fn _mm512_shuffle_ps(arg1: __m512, arg2: __m512, arg3: ::std::os::raw::c_int) -> __m512;
}
extern "C" {
    pub fn _mm512_mask_shuffle_ps(
        arg1: __m512,
        arg2: __mmask16,
        arg3: __m512,
        arg4: __m512,
        arg5: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_maskz_shuffle_ps(
        arg1: __mmask16,
        arg2: __m512,
        arg3: __m512,
        arg4: ::std::os::raw::c_int,
    ) -> __m512;
}
extern "C" {
    pub fn _mm512_cmpeq_ps_mask(arg1: __m512, arg2: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_cmple_ps_mask(arg1: __m512, arg2: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_cmplt_ps_mask(arg1: __m512, arg2: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_cmpneq_ps_mask(arg1: __m512, arg2: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_cmpnle_ps_mask(arg1: __m512, arg2: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_cmpnlt_ps_mask(arg1: __m512, arg2: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_cmpord_ps_mask(arg1: __m512, arg2: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_cmpunord_ps_mask(arg1: __m512, arg2: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_mask_cmpeq_ps_mask(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_mask_cmple_ps_mask(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_mask_cmplt_ps_mask(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_mask_cmpneq_ps_mask(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_mask_cmpnle_ps_mask(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_mask_cmpnlt_ps_mask(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_mask_cmpord_ps_mask(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_mask_cmpunord_ps_mask(arg1: __mmask16, arg2: __m512, arg3: __m512) -> __mmask16;
}
extern "C" {
    pub fn _mm512_cmpeq_pd_mask(arg1: __m512d, arg2: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_cmple_pd_mask(arg1: __m512d, arg2: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_cmplt_pd_mask(arg1: __m512d, arg2: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_cmpneq_pd_mask(arg1: __m512d, arg2: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_cmpnle_pd_mask(arg1: __m512d, arg2: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_cmpnlt_pd_mask(arg1: __m512d, arg2: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_cmpord_pd_mask(arg1: __m512d, arg2: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_cmpunord_pd_mask(arg1: __m512d, arg2: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_mask_cmpeq_pd_mask(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_mask_cmple_pd_mask(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_mask_cmplt_pd_mask(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_mask_cmpneq_pd_mask(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_mask_cmpnle_pd_mask(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_mask_cmpnlt_pd_mask(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_mask_cmpord_pd_mask(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_mask_cmpunord_pd_mask(arg1: __mmask8, arg2: __m512d, arg3: __m512d) -> __mmask8;
}
extern "C" {
    pub fn _mm512_setzero_si512() -> __m512i;
}
extern "C" {
    pub fn _mm512_set_epi8(
        arg1: ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_char,
        arg6: ::std::os::raw::c_char,
        arg7: ::std::os::raw::c_char,
        arg8: ::std::os::raw::c_char,
        arg9: ::std::os::raw::c_char,
        arg10: ::std::os::raw::c_char,
        arg11: ::std::os::raw::c_char,
        arg12: ::std::os::raw::c_char,
        arg13: ::std::os::raw::c_char,
        arg14: ::std::os::raw::c_char,
        arg15: ::std::os::raw::c_char,
        arg16: ::std::os::raw::c_char,
        arg17: ::std::os::raw::c_char,
        arg18: ::std::os::raw::c_char,
        arg19: ::std::os::raw::c_char,
        arg20: ::std::os::raw::c_char,
        arg21: ::std::os::raw::c_char,
        arg22: ::std::os::raw::c_char,
        arg23: ::std::os::raw::c_char,
        arg24: ::std::os::raw::c_char,
        arg25: ::std::os::raw::c_char,
        arg26: ::std::os::raw::c_char,
        arg27: ::std::os::raw::c_char,
        arg28: ::std::os::raw::c_char,
        arg29: ::std::os::raw::c_char,
        arg30: ::std::os::raw::c_char,
        arg31: ::std::os::raw::c_char,
        arg32: ::std::os::raw::c_char,
        arg33: ::std::os::raw::c_char,
        arg34: ::std::os::raw::c_char,
        arg35: ::std::os::raw::c_char,
        arg36: ::std::os::raw::c_char,
        arg37: ::std::os::raw::c_char,
        arg38: ::std::os::raw::c_char,
        arg39: ::std::os::raw::c_char,
        arg40: ::std::os::raw::c_char,
        arg41: ::std::os::raw::c_char,
        arg42: ::std::os::raw::c_char,
        arg43: ::std::os::raw::c_char,
        arg44: ::std::os::raw::c_char,
        arg45: ::std::os::raw::c_char,
        arg46: ::std::os::raw::c_char,
        arg47: ::std::os::raw::c_char,
        arg48: ::std::os::raw::c_char,
        arg49: ::std::os::raw::c_char,
        arg50: ::std::os::raw::c_char,
        arg51: ::std::os::raw::c_char,
        arg52: ::std::os::raw::c_char,
        arg53: ::std::os::raw::c_char,
        arg54: ::std::os::raw::c_char,
        arg55: ::std::os::raw::c_char,
        arg56: ::std::os::raw::c_char,
        arg57: ::std::os::raw::c_char,
        arg58: ::std::os::raw::c_char,
        arg59: ::std::os::raw::c_char,
        arg60: ::std::os::raw::c_char,
        arg61: ::std::os::raw::c_char,
        arg62: ::std::os::raw::c_char,
        arg63: ::std::os::raw::c_char,
        arg64: ::std::os::raw::c_char,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_set_epi16(
        arg1: ::std::os::raw::c_short,
        arg2: ::std::os::raw::c_short,
        arg3: ::std::os::raw::c_short,
        arg4: ::std::os::raw::c_short,
        arg5: ::std::os::raw::c_short,
        arg6: ::std::os::raw::c_short,
        arg7: ::std::os::raw::c_short,
        arg8: ::std::os::raw::c_short,
        arg9: ::std::os::raw::c_short,
        arg10: ::std::os::raw::c_short,
        arg11: ::std::os::raw::c_short,
        arg12: ::std::os::raw::c_short,
        arg13: ::std::os::raw::c_short,
        arg14: ::std::os::raw::c_short,
        arg15: ::std::os::raw::c_short,
        arg16: ::std::os::raw::c_short,
        arg17: ::std::os::raw::c_short,
        arg18: ::std::os::raw::c_short,
        arg19: ::std::os::raw::c_short,
        arg20: ::std::os::raw::c_short,
        arg21: ::std::os::raw::c_short,
        arg22: ::std::os::raw::c_short,
        arg23: ::std::os::raw::c_short,
        arg24: ::std::os::raw::c_short,
        arg25: ::std::os::raw::c_short,
        arg26: ::std::os::raw::c_short,
        arg27: ::std::os::raw::c_short,
        arg28: ::std::os::raw::c_short,
        arg29: ::std::os::raw::c_short,
        arg30: ::std::os::raw::c_short,
        arg31: ::std::os::raw::c_short,
        arg32: ::std::os::raw::c_short,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_set_epi32(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
        arg8: ::std::os::raw::c_int,
        arg9: ::std::os::raw::c_int,
        arg10: ::std::os::raw::c_int,
        arg11: ::std::os::raw::c_int,
        arg12: ::std::os::raw::c_int,
        arg13: ::std::os::raw::c_int,
        arg14: ::std::os::raw::c_int,
        arg15: ::std::os::raw::c_int,
        arg16: ::std::os::raw::c_int,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_set_epi64(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_longlong,
        arg4: ::std::os::raw::c_longlong,
        arg5: ::std::os::raw::c_longlong,
        arg6: ::std::os::raw::c_longlong,
        arg7: ::std::os::raw::c_longlong,
        arg8: ::std::os::raw::c_longlong,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_setr_epi8(
        arg1: ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_char,
        arg6: ::std::os::raw::c_char,
        arg7: ::std::os::raw::c_char,
        arg8: ::std::os::raw::c_char,
        arg9: ::std::os::raw::c_char,
        arg10: ::std::os::raw::c_char,
        arg11: ::std::os::raw::c_char,
        arg12: ::std::os::raw::c_char,
        arg13: ::std::os::raw::c_char,
        arg14: ::std::os::raw::c_char,
        arg15: ::std::os::raw::c_char,
        arg16: ::std::os::raw::c_char,
        arg17: ::std::os::raw::c_char,
        arg18: ::std::os::raw::c_char,
        arg19: ::std::os::raw::c_char,
        arg20: ::std::os::raw::c_char,
        arg21: ::std::os::raw::c_char,
        arg22: ::std::os::raw::c_char,
        arg23: ::std::os::raw::c_char,
        arg24: ::std::os::raw::c_char,
        arg25: ::std::os::raw::c_char,
        arg26: ::std::os::raw::c_char,
        arg27: ::std::os::raw::c_char,
        arg28: ::std::os::raw::c_char,
        arg29: ::std::os::raw::c_char,
        arg30: ::std::os::raw::c_char,
        arg31: ::std::os::raw::c_char,
        arg32: ::std::os::raw::c_char,
        arg33: ::std::os::raw::c_char,
        arg34: ::std::os::raw::c_char,
        arg35: ::std::os::raw::c_char,
        arg36: ::std::os::raw::c_char,
        arg37: ::std::os::raw::c_char,
        arg38: ::std::os::raw::c_char,
        arg39: ::std::os::raw::c_char,
        arg40: ::std::os::raw::c_char,
        arg41: ::std::os::raw::c_char,
        arg42: ::std::os::raw::c_char,
        arg43: ::std::os::raw::c_char,
        arg44: ::std::os::raw::c_char,
        arg45: ::std::os::raw::c_char,
        arg46: ::std::os::raw::c_char,
        arg47: ::std::os::raw::c_char,
        arg48: ::std::os::raw::c_char,
        arg49: ::std::os::raw::c_char,
        arg50: ::std::os::raw::c_char,
        arg51: ::std::os::raw::c_char,
        arg52: ::std::os::raw::c_char,
        arg53: ::std::os::raw::c_char,
        arg54: ::std::os::raw::c_char,
        arg55: ::std::os::raw::c_char,
        arg56: ::std::os::raw::c_char,
        arg57: ::std::os::raw::c_char,
        arg58: ::std::os::raw::c_char,
        arg59: ::std::os::raw::c_char,
        arg60: ::std::os::raw::c_char,
        arg61: ::std::os::raw::c_char,
        arg62: ::std::os::raw::c_char,
        arg63: ::std::os::raw::c_char,
        arg64: ::std::os::raw::c_char,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_setr_epi16(
        arg1: ::std::os::raw::c_short,
        arg2: ::std::os::raw::c_short,
        arg3: ::std::os::raw::c_short,
        arg4: ::std::os::raw::c_short,
        arg5: ::std::os::raw::c_short,
        arg6: ::std::os::raw::c_short,
        arg7: ::std::os::raw::c_short,
        arg8: ::std::os::raw::c_short,
        arg9: ::std::os::raw::c_short,
        arg10: ::std::os::raw::c_short,
        arg11: ::std::os::raw::c_short,
        arg12: ::std::os::raw::c_short,
        arg13: ::std::os::raw::c_short,
        arg14: ::std::os::raw::c_short,
        arg15: ::std::os::raw::c_short,
        arg16: ::std::os::raw::c_short,
        arg17: ::std::os::raw::c_short,
        arg18: ::std::os::raw::c_short,
        arg19: ::std::os::raw::c_short,
        arg20: ::std::os::raw::c_short,
        arg21: ::std::os::raw::c_short,
        arg22: ::std::os::raw::c_short,
        arg23: ::std::os::raw::c_short,
        arg24: ::std::os::raw::c_short,
        arg25: ::std::os::raw::c_short,
        arg26: ::std::os::raw::c_short,
        arg27: ::std::os::raw::c_short,
        arg28: ::std::os::raw::c_short,
        arg29: ::std::os::raw::c_short,
        arg30: ::std::os::raw::c_short,
        arg31: ::std::os::raw::c_short,
        arg32: ::std::os::raw::c_short,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_setr_epi32(
        arg1: ::std::os::raw::c_int,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
        arg8: ::std::os::raw::c_int,
        arg9: ::std::os::raw::c_int,
        arg10: ::std::os::raw::c_int,
        arg11: ::std::os::raw::c_int,
        arg12: ::std::os::raw::c_int,
        arg13: ::std::os::raw::c_int,
        arg14: ::std::os::raw::c_int,
        arg15: ::std::os::raw::c_int,
        arg16: ::std::os::raw::c_int,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_setr_epi64(
        arg1: ::std::os::raw::c_longlong,
        arg2: ::std::os::raw::c_longlong,
        arg3: ::std::os::raw::c_longlong,
        arg4: ::std::os::raw::c_longlong,
        arg5: ::std::os::raw::c_longlong,
        arg6: ::std::os::raw::c_longlong,
        arg7: ::std::os::raw::c_longlong,
        arg8: ::std::os::raw::c_longlong,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_set1_epi8(arg1: ::std::os::raw::c_char) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_set1_epi8(
        arg1: __m512i,
        arg2: __mmask64,
        arg3: ::std::os::raw::c_char,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_set1_epi8(arg1: __mmask64, arg2: ::std::os::raw::c_char) -> __m512i;
}
extern "C" {
    pub fn _mm512_set1_epi16(arg1: ::std::os::raw::c_short) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_set1_epi16(
        arg1: __m512i,
        arg2: __mmask32,
        arg3: ::std::os::raw::c_short,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_set1_epi16(arg1: __mmask32, arg2: ::std::os::raw::c_short) -> __m512i;
}
extern "C" {
    pub fn _mm512_set1_epi32(arg1: ::std::os::raw::c_int) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_set1_epi32(
        arg1: __m512i,
        arg2: __mmask16,
        arg3: ::std::os::raw::c_int,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_set1_epi32(arg1: __mmask16, arg2: ::std::os::raw::c_int) -> __m512i;
}
extern "C" {
    pub fn _mm512_set1_epi64(arg1: ::std::os::raw::c_longlong) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_set1_epi64(
        arg1: __m512i,
        arg2: __mmask8,
        arg3: ::std::os::raw::c_longlong,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_set1_epi64(arg1: __mmask8, arg2: ::std::os::raw::c_longlong) -> __m512i;
}
extern "C" {
    pub fn _mm512_add_epi8(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_add_epi8(
        arg1: __m512i,
        arg2: __mmask64,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_add_epi8(arg1: __mmask64, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_add_epi16(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_add_epi16(
        arg1: __m512i,
        arg2: __mmask32,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_add_epi16(arg1: __mmask32, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_add_epi32(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_add_epi32(
        arg1: __m512i,
        arg2: __mmask16,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_add_epi32(arg1: __mmask16, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_add_epi64(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_add_epi64(
        arg1: __m512i,
        arg2: __mmask8,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_add_epi64(arg1: __mmask8, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_adds_epi8(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_adds_epi8(
        arg1: __m512i,
        arg2: __mmask64,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_adds_epi8(arg1: __mmask64, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_adds_epi16(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_adds_epi16(
        arg1: __m512i,
        arg2: __mmask32,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_adds_epi16(arg1: __mmask32, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_adds_epu8(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_adds_epu8(
        arg1: __m512i,
        arg2: __mmask64,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_adds_epu8(arg1: __mmask64, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_adds_epu16(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_adds_epu16(
        arg1: __m512i,
        arg2: __mmask32,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_adds_epu16(arg1: __mmask32, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_abs_epi8(arg1: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_abs_epi8(arg1: __m512i, arg2: __mmask64, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_abs_epi8(arg1: __mmask64, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_abs_epi16(arg1: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_abs_epi16(arg1: __m512i, arg2: __mmask32, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_abs_epi16(arg1: __mmask32, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_abs_epi32(arg1: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_abs_epi32(arg1: __m512i, arg2: __mmask16, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_abs_epi32(arg1: __mmask16, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_abs_epi64(arg1: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_abs_epi64(arg1: __m512i, arg2: __mmask8, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_abs_epi64(arg1: __mmask8, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcast_i32x2(arg1: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_broadcast_i32x2(arg1: __m512i, arg2: __mmask16, arg3: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_broadcast_i32x2(arg1: __mmask16, arg2: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcast_i32x4(arg1: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_broadcast_i32x4(arg1: __m512i, arg2: __mmask16, arg3: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_broadcast_i32x4(arg1: __mmask16, arg2: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcast_i32x8(arg1: __m256i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_broadcast_i32x8(arg1: __m512i, arg2: __mmask16, arg3: __m256i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_broadcast_i32x8(arg1: __mmask16, arg2: __m256i) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcast_i64x2(arg1: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_broadcast_i64x2(arg1: __m512i, arg2: __mmask8, arg3: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_broadcast_i64x2(arg1: __mmask8, arg2: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcast_i64x4(arg1: __m256i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_broadcast_i64x4(arg1: __m512i, arg2: __mmask8, arg3: __m256i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_broadcast_i64x4(arg1: __mmask8, arg2: __m256i) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcastb_epi8(arg1: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_broadcastb_epi8(arg1: __m512i, arg2: __mmask64, arg3: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_broadcastb_epi8(arg1: __mmask64, arg2: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcastw_epi16(arg1: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_broadcastw_epi16(arg1: __m512i, arg2: __mmask32, arg3: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_broadcastw_epi16(arg1: __mmask32, arg2: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcastd_epi32(arg1: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_broadcastd_epi32(arg1: __m512i, arg2: __mmask16, arg3: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_broadcastd_epi32(arg1: __mmask16, arg2: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcastq_epi64(arg1: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_broadcastq_epi64(arg1: __m512i, arg2: __mmask8, arg3: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_broadcastq_epi64(arg1: __mmask8, arg2: __m128i) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcastmw_epi32(arg1: __mmask16) -> __m512i;
}
extern "C" {
    pub fn _mm512_broadcastmb_epi64(arg1: __mmask8) -> __m512i;
}
extern "C" {
    pub fn _mm512_sub_epi8(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_sub_epi8(
        arg1: __m512i,
        arg2: __mmask64,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_sub_epi8(arg1: __mmask64, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_sub_epi16(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_sub_epi16(
        arg1: __m512i,
        arg2: __mmask32,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_sub_epi16(arg1: __mmask32, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_sub_epi32(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_sub_epi32(
        arg1: __m512i,
        arg2: __mmask16,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_sub_epi32(arg1: __mmask16, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_sub_epi64(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_sub_epi64(
        arg1: __m512i,
        arg2: __mmask8,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_sub_epi64(arg1: __mmask8, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_subs_epi8(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_subs_epi8(
        arg1: __m512i,
        arg2: __mmask64,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_subs_epi8(arg1: __mmask64, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_subs_epi16(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_subs_epi16(
        arg1: __m512i,
        arg2: __mmask32,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_subs_epi16(arg1: __mmask32, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_subs_epu8(arg1: __m512i, arg2: __m512i) -> __m512i;
}
extern "C" {
    pub fn _mm512_mask_subs_epu8(
        arg1: __m512i,
        arg2: __mmask64,
        arg3: __m512i,
        arg4: __m512i,
    ) -> __m512i;
}
extern "C" {
    pub fn _mm512_maskz_subs_epu8(arg1: __mmask64, arg2: __m512i, arg3: __m512i) -> __m512i;
}
extern "C" {
